Bwooce/tinygs_nRF52/src/main.cpp
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/logging/log_ctrl.h>   /* log_panic() — flush deferred log before reboot */
#include <zephyr/debug/coredump.h>     /* explicit coredump() call from fault handler */
#include <stdarg.h>  /* va_list for early_log_appendf */
#include <zephyr/net/openthread.h>
#include <zephyr/net/mqtt.h>
#include <zephyr/net/net_pkt.h>
#include <zephyr/net/socket.h>
#include <zephyr/net/tls_credentials.h>
#include <zephyr/net_buf.h>
#include <openthread/thread.h>
#include <openthread/error.h>
#include <openthread/netdata.h>
#include <openthread/ip6.h>
#include <openthread/dataset.h>
#include <openthread/dataset_ftd.h>
#include <openthread/dns_client.h>
#include <openthread/joiner.h>
#include <openthread/link.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/net/ieee802154_radio.h>  /* direct radio rx-on-when-idle during joiner DTLS */

#include <zephyr/usb/usb_device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/uart/cdc_acm.h>
#include <zephyr/fs/fs.h>
#include <ff.h>
#include <zephyr/storage/disk_access.h>

#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/spi.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/dt-bindings/adc/nrf-adc.h>
#include <zephyr/dt-bindings/adc/nrf-saadc.h>  /* NRF_SAADC_AIN2 — DT channel index */
#include <zephyr/sys/base64.h>
#include <zephyr/drivers/watchdog.h>
#if defined(CONFIG_LED_STRIP)
#include <zephyr/drivers/led_strip.h>
#endif
#include <openthread/sntp.h>
#include <time.h>
#include "tinygs_display.h"
#include <zephyr/drivers/hwinfo.h>
#include <hal/nrf_power.h>
#include <hal/nrf_ficr.h>

#include <mbedtls/debug.h>
#if defined(CONFIG_MBEDTLS_MEMORY_BUFFER_ALLOC_C)
#include <mbedtls/memory_buffer_alloc.h>
#endif
#include <RadioLib.h>
#include "hal/Zephyr/ZephyrHal.h"
#include "tinygs_protocol.h"
#include "tinygs_json.h"
#include "tinygs_config.h"
#include "bitcode.h"
#include "web/web_ui.h"
#if defined(CONFIG_IOT_LOG)
#include <iot_log_zephyr.h>
#endif

LOG_MODULE_REGISTER(tinygs_nrf52, LOG_LEVEL_DBG);

/* Joiner PSKd. Mirrors the prj.conf TINYGS_JOINER_PSKD value but
 * defined here so we don't depend on the Kconfig — the Kconfig only exists
 * when CONFIG_OPENTHREAD_JOINER_AUTOSTART=y, and we want to keep AUTOSTART
 * disabled (our init_openthread() drives joiner explicitly, eliminating the
 * race with the platform autostart). Keep the two strings in sync. */
#define TINYGS_JOINER_PSKD "TNYGS2026NRF"

/* Translate common negative errno values to symbolic names. Values
 * match Zephyr minimal libc errno.h, which differs from POSIX above
 * 100. Falls back to "?" so %s is safe. Declared extern "C" in
 * tinygs_protocol.h so other TUs can call it. */
extern "C" const char *errno_name(int err)
{
    switch (err < 0 ? -err : err) {
    case 0:   return "OK";
    case 5:   return "EIO";
    case 11:  return "EAGAIN";
    case 12:  return "ENOMEM";
    case 22:  return "EINVAL";
    case 61:  return "ENODATA";
    case 104: return "ECONNRESET";
    case 105: return "ENOBUFS";
    case 110: return "ESHUTDOWN";
    case 111: return "ECONNREFUSED";
    case 113: return "ECONNABORTED";
    case 114: return "ENETUNREACH";
    case 115: return "ENETDOWN";
    case 116: return "ETIMEDOUT";
    case 117: return "EHOSTDOWN";
    case 118: return "EHOSTUNREACH";
    case 119: return "EINPROGRESS";
    case 128: return "ENOTCONN";
    case 134: return "ENOTSUP";
    case 140: return "ECANCELED";
    default:  return "?";
    }
}

/* RadioLib status/error codes (from lib/RadioLib/src/TypeDef.h). Covers
 * only the codes we realistically see on SX1262 LoRa/FSK begin and RX
 * paths — adding everything would be ~70 entries and most aren't
 * reachable on this chip. */
static const char *radio_err_name(int err)
{
    switch (err) {
    case 0:    return "OK";
    case -1:   return "UNKNOWN";
    case -2:   return "CHIP_NOT_FOUND";
    case -3:   return "MEMORY_ALLOCATION_FAILED";
    case -4:   return "PACKET_TOO_LONG";
    case -5:   return "TX_TIMEOUT";
    case -6:   return "RX_TIMEOUT";
    case -7:   return "CRC_MISMATCH";
    case -8:   return "INVALID_BANDWIDTH";
    case -9:   return "INVALID_SPREADING_FACTOR";
    case -10:  return "INVALID_CODING_RATE";
    case -12:  return "INVALID_FREQUENCY";
    case -13:  return "INVALID_OUTPUT_POWER";
    case -16:  return "SPI_WRITE_FAILED";
    case -17:  return "INVALID_CURRENT_LIMIT";
    case -18:  return "INVALID_PREAMBLE_LENGTH";
    case -19:  return "INVALID_GAIN";
    case -20:  return "WRONG_MODEM";
    case -24:  return "LORA_HEADER_DAMAGED";
    case -25:  return "UNSUPPORTED";
    case -28:  return "NULL_POINTER";
    case -30:  return "PACKET_TOO_SHORT";
    case -101: return "INVALID_BIT_RATE";
    case -102: return "INVALID_FREQUENCY_DEVIATION";
    case -103: return "INVALID_BIT_RATE_BW_RATIO";
    case -104: return "INVALID_RX_BANDWIDTH";
    case -105: return "INVALID_SYNC_WORD";
    case -106: return "INVALID_DATA_SHAPING";
    case -107: return "INVALID_MODULATION";
    case -701: return "INVALID_CRC_CONFIGURATION";
    case -703: return "INVALID_TCXO_VOLTAGE";
    case -704: return "INVALID_MODULATION_PARAMETERS";
    case -705: return "SPI_CMD_TIMEOUT";
    case -706: return "SPI_CMD_INVALID";
    case -707: return "SPI_CMD_FAILED";
    default:   return "?";
    }
}

/* Forward declarations for radio RX */
static void lora_rx_callback(void);
static volatile bool lora_packet_received = false;

/* Crash diagnostic — __noinit survives warm reset (SREQ doesn't clear RAM) */
#define CRASH_MAGIC     0xDEAD0000  /* CPU fault (k_sys_fatal_error_handler) */
#define WDT_CRASH_MAGIC 0xD06D0000  /* Watchdog pre-fire (the "DOG" died) */
#define MQTT_SILENCE_MAGIC 0xC0FF0000 /* MQTT-alive watchdog forced reboot — main + WDT
                                       * stayed happy but no MQTT activity for too long.
                                       * Catches Thread-stack/network-layer wedges that
                                       * the CPU-level WDT can't see. High-16 only so
                                       * the boot-time `& 0xFFFF0000 ==` check matches. */
static volatile uint32_t __noinit crash_reason;
static volatile uint32_t __noinit crash_pc;
static volatile uint32_t __noinit crash_lr;
static volatile uint32_t __noinit crash_icsr;  /* SCB->ICSR — VECTACTIVE identifies the IRQ */
static volatile uint32_t __noinit crash_thread_ptr; /* raw k_current_get() for post-mortem decode */
static char __noinit crash_thread[16];

/* Cortex-M fault-status registers — let us distinguish "PC was garbage from
 * smashed return address" (UFSR.INVPC) from "CPU executed a real instruction
 * that did unaligned access" (UFSR.UNALIGNED) etc. CFSR layout:
 *   bits 0-7   MMFSR
 *   bits 8-15  BFSR
 *   bits 16-31 UFSR (UNDEFINSTR=16, INVSTATE=17, INVPC=18, NOCP=19,
 *                    UNALIGNED=24, DIVBYZERO=25) */
static volatile uint32_t __noinit crash_cfsr;
static volatile uint32_t __noinit crash_hfsr;
static volatile uint32_t __noinit crash_mmfar;
static volatile uint32_t __noinit crash_bfar;
/* Rest of basic ESF — may hold pre-corruption call args / return path */
static volatile uint32_t __noinit crash_r0;
static volatile uint32_t __noinit crash_r1;
static volatile uint32_t __noinit crash_r2;
static volatile uint32_t __noinit crash_r3;
static volatile uint32_t __noinit crash_r12;
static volatile uint32_t __noinit crash_xpsr;
/* Snapshot 8 words from the faulting stack (above the ESF push) so we can
 * see the call chain that was on the stack before the smash. */
static volatile uint32_t __noinit crash_sp;
static volatile uint32_t __noinit crash_stack[8];
/* Extra ESF (CONFIG_EXTRA_EXCEPTION_INFO): callee-saved regs r4–r11 and
 * exc_return/msp. Callee-saved regs are pushed by Zephyr separately on its
 * own kernel-mode stack, so they survive even when the faulting thread's
 * PSP is smashed — much more reliable than basic-ESF in fault-in-fault. */
static volatile uint32_t __noinit crash_r4;
static volatile uint32_t __noinit crash_r5;
static volatile uint32_t __noinit crash_r6;
static volatile uint32_t __noinit crash_r7;
static volatile uint32_t __noinit crash_r8;
static volatile uint32_t __noinit crash_r9;
static volatile uint32_t __noinit crash_r10;
static volatile uint32_t __noinit crash_r11;
static volatile uint32_t __noinit crash_msp;
static volatile uint32_t __noinit crash_exc_return;

/* Watchdog feeder tracking — last thread to call watchdog_feed(), captured
 * at pre-fire so we can identify whose loop went silent. The hung thread
 * is usually NOT this one (this one was running fine until something else
 * blocked the system); often the more useful clue is "feeder is X, but
 * crash_thread (the thread running at WDT pre-fire) is Y". */
static volatile uint32_t __noinit wdt_last_feed_uptime_ms;
static volatile uint32_t __noinit wdt_last_feeder_thread_ptr;
static char __noinit wdt_last_feeder_name[16];

/* Main-loop liveness — bumped each iteration of the STATE_MQTT_CONNECTED
 * inner loop, with a phase tag set at each step inside that iteration.
 * The whole point: WDT feed lives in the MQTT event handler, so a fire
 * means MQTT went silent — but the feeder thread name alone can't tell
 * us whether main is also hung or just spinning healthily waiting for
 * traffic. main_alive_uptime_ms close to wdt_last_feed_uptime_ms = main
 * is fine, broker silent. main_alive far older = main itself wedged in
 * whatever step main_phase identifies. */
#define MAIN_PHASE_INIT      0
#define MAIN_PHASE_POLL      1  /* zsock_poll on MQTT socket */
#define MAIN_PHASE_MQTT_LIVE 2  /* mqtt_live (PINGREQ etc.) */
#define MAIN_PHASE_LORA_RX   3  /* lora_check_rx */
#define MAIN_PHASE_DISPLAY   4  /* tinygs_display_update */
#define MAIN_PHASE_DOPPLER   5  /* doppler_update */
#define MAIN_PHASE_PING      6  /* tinygs_send_ping */
#define MAIN_PHASE_WEBLOGIN  7  /* tinygs_send_weblogin_request */
#define MAIN_PHASE_STATUS    8  /* periodic STATUS log */
static volatile uint8_t  __noinit main_phase;
static volatile uint32_t __noinit main_alive_uptime_ms;

