Bwooce/tinygs_nRF52/src/main.cpp
/* MQTT-alive watchdog — separate from the hardware WDT. Tracks the most recent
 * MQTT round-trip (CONNACK / PINGRESP / any incoming PUBLISH). Checked at the
 * top of the outer state-machine loop in any state; if the gap exceeds the
 * threshold below, force a sys_reboot so the boot diagnostic can record the
 * cause. Catches Thread-stack/network-stack wedges that leave main looping
 * happily but cut us off from the broker — modes the old MQTT-fed WDT used to
 * catch implicitly via missed PINGRESPs. Also catches boot-loop scenarios
 * where reconnect never reaches CONNECTED. The __noinit silence_uptime_ms
 * captures the last_activity at trigger time so we know how long the gap was. */
/* Reconnect tier (primary): forced PINGREQ every MQTT_FORCE_PING_INTERVAL_MS,
 * then existing TINYGS_MQTT_UNACKED_PING_MAX (=2) check fires a clean
 * reconnect after broker silence ≈ 2 × interval. Catches genuinely-broken
 * connections without false-positiving on quiet idle (server-pushed
 * commands can be minutes apart during quiet sat windows).
 *
 * Reboot tier (catastrophic-only): MQTT_SILENCE_TIMEOUT_MS of total
 * inbound silence triggers sys_reboot. Only fires if even mqtt_ping itself
 * is wedged (TX path broken / mutex deadlock) — the unacked-ping reconnect
 * should win in normal failure modes long before this. Threshold raised
 * from earlier 5 min → 10 min to give the reconnect path more headroom. */
#define MQTT_FORCE_PING_INTERVAL_MS 60000   /* 60 s — sized so 2 missed PINGRESPs = ~120 s detection */
#define MQTT_SILENCE_TIMEOUT_MS    600000   /* 10 min — sys_reboot last resort */
static volatile uint32_t mqtt_last_activity_ms;          /* per-boot, not __noinit */
static volatile uint32_t __noinit mqtt_silence_uptime_ms;

static const char *main_phase_name(uint8_t p)
{
    switch (p) {
    case MAIN_PHASE_INIT:      return "init";
    case MAIN_PHASE_POLL:      return "poll";
    case MAIN_PHASE_MQTT_LIVE: return "mqtt_live";
    case MAIN_PHASE_LORA_RX:   return "lora_rx";
    case MAIN_PHASE_DISPLAY:   return "display";
    case MAIN_PHASE_DOPPLER:   return "doppler";
    case MAIN_PHASE_PING:      return "ping";
    case MAIN_PHASE_WEBLOGIN:  return "weblogin";
    case MAIN_PHASE_STATUS:    return "status";
    default:                   return "?";
    }
}

/* nRF52840 SRAM covers 0x20000000 – 0x2003FFFF (256 KB). Any pointer used
 * in the fault handler is sanity-checked against this range before we
 * dereference, so a corrupt thread struct or runaway pointer won't double-
 * fault us inside the handler and prevent __noinit diagnostics from landing. */
#define IN_SRAM(p) ((uintptr_t)(p) >= 0x20000000u && (uintptr_t)(p) < 0x20040000u)

/* v3.3: openthread_context.instance is no longer populated by the L2 layer.
 * Use the new singleton accessor via this forward declaration (defined in
 * the openthread module's internal header which we don't pull in directly). */
extern "C" struct otInstance *openthread_get_default_instance(void);

/* Latches set by the web UI (/cs commands) — drained from the main loop. */
extern "C" bool web_ui_pop_test_packet_request(void);
extern "C" bool web_ui_pop_reboot_request(void);

/* z_arch_esf_t was renamed to arch_esf in Zephyr v3.x. */
extern "C" void k_sys_fatal_error_handler(unsigned int reason,
                                           const struct arch_esf *esf)
{
    /* Drain whatever Zephyr's z_arm_fault already queued (CFSR/UFSR/BFSR
     * dump, faulting-instruction line). Without panic-mode the messages
     * stay in the deferred log queue and the log thread never runs again
     * because we're about to sys_reboot. log_panic() switches every
     * backend to synchronous and processes pending messages in-place. */
    log_panic();

    /* Force coredump dump explicitly. Zephyr's z_arm_fault is supposed to
     * call coredump() when CONFIG_DEBUG_COREDUMP is set, but its output
     * was going to the deferred log queue and getting dropped. With
     * log_panic() now in panic mode, the bytes will flush synchronously. */
    coredump(reason, esf, (struct k_thread *)k_current_get());

    crash_reason = CRASH_MAGIC | (reason & 0xFFFF);
    crash_icsr  = *(volatile uint32_t *)0xE000ED04; /* SCB->ICSR */
    /* NOTE: CFSR/HFSR/MMFAR/BFAR may already be cleared by z_arm_fault by
     * the time we run — Zephyr clears each section after handling it. We
     * still capture in case of HardFault paths that bypass that clearing. */
    crash_cfsr  = *(volatile uint32_t *)0xE000ED28;
    crash_hfsr  = *(volatile uint32_t *)0xE000ED2C;
    crash_mmfar = *(volatile uint32_t *)0xE000ED34;
    crash_bfar  = *(volatile uint32_t *)0xE000ED38;

    if (esf) {
        crash_pc   = esf->basic.pc;
        crash_lr   = esf->basic.lr;
        crash_r0   = esf->basic.r0;
        crash_r1   = esf->basic.r1;
        crash_r2   = esf->basic.r2;
        crash_r3   = esf->basic.r3;
        crash_r12  = esf->basic.ip;     /* "ip" alias for r12 in Zephyr ESF */
        crash_xpsr = esf->basic.xpsr;
#if defined(CONFIG_EXTRA_EXCEPTION_INFO)
        /* Callee-saved regs are pushed by Zephyr separately, not by the CPU
         * onto the PSP. So when the PSP is smashed (our case — basic-ESF
         * is all garbage), r4–r11 still hold sane values from the function
         * that was executing when the original fault fired. These often
         * pinpoint the actual caller. */
        crash_exc_return = esf->extra_info.exc_return;
        crash_msp        = esf->extra_info.msp;
        if (esf->extra_info.callee != NULL && IN_SRAM(esf->extra_info.callee)) {
            crash_r4  = esf->extra_info.callee->v1;
            crash_r5  = esf->extra_info.callee->v2;
            crash_r6  = esf->extra_info.callee->v3;
            crash_r7  = esf->extra_info.callee->v4;
            crash_r8  = esf->extra_info.callee->v5;
            crash_r9  = esf->extra_info.callee->v6;
            crash_r10 = esf->extra_info.callee->v7;
            crash_r11 = esf->extra_info.callee->v8;
        }
#endif
        /* The ESF was pushed by the CPU on top of the faulting thread's stack.
         * The next 8 words above the ESF (basic ESF is 8 words / 32 bytes
         * unless FP context is also stacked, which we don't have on
         * nRF52840) are the last meaningful frames of the call chain
         * pre-fault — i.e. saved LRs / locals that survived whatever smash
         * happened. Range-check before reading. */
        const uint32_t *stk = (const uint32_t *)(((uintptr_t)esf) + 32);
        crash_sp = (uint32_t)(uintptr_t)stk;
        if (IN_SRAM(stk) && IN_SRAM(stk + 7)) {
            for (int i = 0; i < 8; i++) {
                crash_stack[i] = stk[i];
            }
        } else {
            for (int i = 0; i < 8; i++) {
                crash_stack[i] = 0xBADBAD00 | i;
            }
        }
    }

    /* Thread pointer is always safe to record — k_current_get() just reads
     * a kernel global, no dereference. A raw pointer is human-decodable
     * against the map file, which is enough to identify the thread even
     * if the name string can't be captured. */
    void *tp = k_current_get();
    crash_thread_ptr = (uint32_t)(uintptr_t)tp;

    /* Name capture is best-effort. If the initial fault was a stack smash
     * that corrupted the thread struct or kernel globals, dereferencing
     * through k_thread_name_get() would fault again inside this handler
     * (the Cortex-M hard-fault-in-handler → lockup path) and the watchdog
     * would have to recover us without any diagnostic. Range-check the
     * pointer first and bail out of the strncpy if anything looks off. */
    crash_thread[0] = '\0';
    if (IN_SRAM(tp)) {
        const char *tname = k_thread_name_get((struct k_thread *)tp);
        if (IN_SRAM(tname)) {
            /* Inline copy with an explicit per-char SRAM guard on the
             * source — if the name string itself points into bad memory,
             * we stop at the first byte we can't safely read rather than
             * running strncpy all the way. */
            size_t i;
            for (i = 0; i < sizeof(crash_thread) - 1; i++) {
                if (!IN_SRAM(tname + i)) break;
                char c = tname[i];
                if (c == '\0') break;
                crash_thread[i] = c;
            }
            crash_thread[i] = '\0';
        }
    }

    sys_reboot(SYS_REBOOT_COLD);
}

