Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Heap / RAM instrumentation                                                  */
/* -------------------------------------------------------------------------- */

extern struct k_heap _system_heap;

/* -------------------------------------------------------------------------- */
/* Heap unification: malloc/free routed to k_malloc/k_free                    */
/*                                                                            */
/* By default Zephyr keeps two separate heaps: _system_heap (k_malloc, sized  */
/* by HEAP_MEM_POOL_SIZE) and z_malloc_heap (libc malloc, sized by            */
/* COMMON_LIBC_MALLOC_ARENA_SIZE). RadioLib's per-SPI-op transient mallocs    */
/* and our `new Module()` / `new SX1262()` go to the libc heap; getaddrinfo / */
/* internal Zephyr go to _system_heap. Each is over-provisioned in isolation  */
/* (4 KB libc / 2 KB sys, peaks 1.7 / 0.5 KB) — wasted ~3.5 KB combined.      */
/*                                                                            */
/* The --wrap=malloc,calloc,realloc,free linker flag lets us redirect all     */
/* libc malloc traffic into k_malloc, so both consumers share _system_heap.   */
/* z_malloc_heap is now unused (its 64-byte stub arena is dead BSS) but we    */
/* can't drop it cleanly: ARENA_SIZE=0 makes malloc grab all unused SRAM.     */
/* -------------------------------------------------------------------------- */
extern "C" void *__wrap_malloc(size_t size)
{
    return k_malloc(size);
}

extern "C" void __wrap_free(void *p)
{
    k_free(p);
}

extern "C" void *__wrap_calloc(size_t nmemb, size_t size)
{
    return k_calloc(nmemb, size);
}

extern "C" void *__wrap_realloc(void *ptr, size_t size)
{
    return k_realloc(ptr, size);
}

static void log_heap_usage(const char *label)
{
#ifdef CONFIG_SYS_HEAP_RUNTIME_STATS
    struct sys_memory_stats stats;
    if (sys_heap_runtime_stats_get(&_system_heap.heap, &stats) == 0) {
        LOG_INF("RAM [%s]: sys_heap used=%u free=%u max=%u",
                label,
                (unsigned)stats.allocated_bytes,
                (unsigned)stats.free_bytes,
                (unsigned)stats.max_allocated_bytes);
    }
#endif
}

/* -------------------------------------------------------------------------- */
/* Application State Machine                                                  */
/* -------------------------------------------------------------------------- */

enum app_state {
    STATE_WAIT_THREAD,
    STATE_DNS_RESOLVE,
    STATE_MQTT_CONNECT,
    STATE_MQTT_CONNECTED,
    STATE_ERROR,
};

enum app_state app_state = STATE_WAIT_THREAD;
volatile bool thread_attached = false;

/* Accessor for cross-TU consumers (web UI) — avoids leaking the enum. */
extern "C" bool tinygs_mqtt_is_connected(void)
{
    return app_state == STATE_MQTT_CONNECTED;
}

/* Public wrapper around the static-inline usb_vbus_present() so the
 * web UI's /wm handler can render USB-vs-battery in the Power row. */
extern "C" bool tinygs_usb_vbus_present(void);

/* -------------------------------------------------------------------------- */
/* MQTT Configuration                                                         */
/* -------------------------------------------------------------------------- */

#define MQTT_BROKER_HOSTNAME "mqtt.tinygs.com"
#define MQTT_BROKER_PORT     8883
#include "mqtt_credentials.h" /* MQTT_USERNAME, MQTT_PASSWORD defaults — gitignored */
#include "tinygs_ca_cert.h"   /* TinyGS server cert for TLS cipher suite config */
#define MQTT_TLS_SEC_TAG     1

/* Runtime config variables are in tinygs_config.cpp, declared in tinygs_config.h */

/* MQTT client and buffers */
static struct mqtt_client mqtt_client;
static uint8_t mqtt_rx_buf[256];  /* Streaming read: headers + topic of incoming PUBLISH */
static uint8_t mqtt_tx_buf[128];  /* MQTT framing only: header+topic; payload sent via iovec */
static struct sockaddr_storage broker_addr;

/* -------------------------------------------------------------------------- */
/* Hardware: Vext, SPI, LoRa pins                                             */
/* -------------------------------------------------------------------------- */

static const struct gpio_dt_spec vext_pwr = GPIO_DT_SPEC_GET(DT_ALIAS(vext), gpios);

static const struct spi_dt_spec lora_spi = SPI_DT_SPEC_GET(DT_NODELABEL(sx1262), SPI_WORD_SET(8) | SPI_TRANSFER_MSB, 0);
static const struct gpio_dt_spec lora_cs = GPIO_DT_SPEC_GET_BY_IDX(DT_PARENT(DT_NODELABEL(sx1262)), cs_gpios, 0);
static const struct gpio_dt_spec lora_reset = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), reset_gpios);
static const struct gpio_dt_spec lora_busy = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), busy_gpios);
static const struct gpio_dt_spec lora_dio1 = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), dio1_gpios);

static void enable_peripherals(void)
{
    if (device_is_ready(vext_pwr.port)) {
        gpio_pin_configure_dt(&vext_pwr, GPIO_OUTPUT_ACTIVE);
        gpio_pin_set_dt(&vext_pwr, 1);
        k_msleep(500);
        LOG_INF("Vext power enabled");
    }
}

/* -------------------------------------------------------------------------- */
/* Hardware Watchdog                                                            */
/* -------------------------------------------------------------------------- */

static const struct device *wdt_dev = DEVICE_DT_GET(DT_NODELABEL(wdt0));
static int wdt_channel_id = -1;

/* Pre-fire callback — nRF52840 WDT fires this ~62.5 ms before the actual
 * SoC reset (one CRV tick at 32.768 kHz LFCLK). Capture which thread was
 * running at the time of the hang into the crash_* __noinit slots so the
 * next boot can identify it. Same fields as k_sys_fatal_error_handler
 * uses, distinguished by WDT_CRASH_MAGIC vs CRASH_MAGIC.
 *
 * Runs in IRQ context with interrupts otherwise enabled — keep it short,
 * don't take mutexes, don't allocate. Touch only volatile + range-checked
 * pointers, exactly like the fault handler's belt-and-braces pattern. */
static void wdt_pre_fire_handler(const struct device *dev, int channel_id)
{
    ARG_UNUSED(dev);
    ARG_UNUSED(channel_id);

    crash_reason = WDT_CRASH_MAGIC;
    crash_icsr = *(volatile uint32_t *)0xE000ED04;

    /* WDT IRQ entry pushed an exception frame onto whichever stack was
     * active. Almost always PSP (we preempted thread mode); read it and
     * grab the saved PC at frame[6], LR at frame[5]. addr2line on PC
     * pinpoints the instruction the thread was about to execute when
     * the WDT fired. Safety: PSP must be 8-byte aligned and within
     * SRAM with room for the 32-byte frame. */
    crash_pc = 0;
    crash_lr = 0;
    uint32_t psp = __get_PSP();
    if ((psp & 7) == 0 && psp >= 0x20000000 && psp <= (0x20000000 + 0x40000 - 32)) {
        const uint32_t *frame = (const uint32_t *)psp;
        crash_lr = frame[5];
        crash_pc = frame[6];
    }

    void *tp = k_current_get();
    crash_thread_ptr = (uint32_t)(uintptr_t)tp;

    crash_thread[0] = '\0';
    if (IN_SRAM(tp)) {
        const char *name = k_thread_name_get((k_tid_t)tp);
        if (name) {
            unsigned i = 0;
            for (; i < sizeof(crash_thread) - 1 && name[i]; i++) {
                crash_thread[i] = name[i];
            }
            crash_thread[i] = '\0';
        }
    }
    crash_thread[sizeof(crash_thread) - 1] = '\0';
}

static void watchdog_init(void)
{
    if (!device_is_ready(wdt_dev)) {
        LOG_WRN("Watchdog not available");
        return;
    }

    struct wdt_timeout_cfg cfg = {
        .window = {
            .min = 0,
            .max = CONFIG_MQTT_KEEPALIVE * 2 * 1000, /* 2x keepalive in ms */
        },
        .callback = wdt_pre_fire_handler,
        .flags = WDT_FLAG_RESET_SOC,
    };

    wdt_channel_id = wdt_install_timeout(wdt_dev, &cfg);
    if (wdt_channel_id < 0) {
        LOG_ERR("Watchdog install failed: %d", wdt_channel_id);
        return;
    }

    int ret = wdt_setup(wdt_dev, WDT_OPT_PAUSE_HALTED_BY_DBG);
    if (ret < 0) {
        LOG_ERR("Watchdog setup failed: %d", ret);
        return;
    }

    LOG_INF("Watchdog: %ds timeout (2x keepalive)", CONFIG_MQTT_KEEPALIVE * 2);
}

static void watchdog_feed(void)
{
    if (wdt_channel_id >= 0) {
        wdt_feed(wdt_dev, wdt_channel_id);

        /* Record who fed the dog last so the pre-fire handler can identify
         * the loop that's still alive vs the one that hung. */
        void *tp = k_current_get();
        wdt_last_feed_uptime_ms = k_uptime_get_32();
        wdt_last_feeder_thread_ptr = (uint32_t)(uintptr_t)tp;
        wdt_last_feeder_name[0] = '\0';
        if (IN_SRAM(tp)) {
            const char *name = k_thread_name_get((k_tid_t)tp);
            if (name) {
                unsigned i = 0;
                for (; i < sizeof(wdt_last_feeder_name) - 1 && name[i]; i++) {
                    wdt_last_feeder_name[i] = name[i];
                }
                wdt_last_feeder_name[i] = '\0';
            }
        }
        wdt_last_feeder_name[sizeof(wdt_last_feeder_name) - 1] = '\0';
    }
}

/* WDT feeder runs on the system workqueue every WDT_FEED_INTERVAL_MS so the
 * dog stays fed in any state — STATE_ERROR's k_msleep(30000), the DNS resolve
 * blocking call, and the TLS handshake all used to drop us out of the (only)
 * feed point inside STATE_MQTT_CONNECTED, blowing the 180 s window. The feed
 * is gated on main_alive_uptime_ms freshness: if main hasn't bumped in
 * WDT_MAIN_FRESHNESS_MS (longer than any legitimate single sleep), the feeder
 * withholds and the WDT fires — preserving CPU-wedge detection. MQTT-level
 * liveness is enforced separately by the MQTT_SILENCE_TIMEOUT_MS check at the
 * top of the outer state-machine loop (any state, not just CONNECTED). */
#define WDT_FEED_INTERVAL_MS    60000   /* 60 s — well below 180 s budget */
#define WDT_MAIN_FRESHNESS_MS   90000   /* covers STATE_ERROR's 30 s sleep + slop */

static void wdt_feeder_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(wdt_feeder_work, wdt_feeder_work_handler);

