Bwooce/tinygs_nRF52/src/main.cpp
static void wdt_feeder_work_handler(struct k_work *work)
{
    uint32_t now = k_uptime_get_32();
    uint32_t age = now - main_alive_uptime_ms;
    if (age <= WDT_MAIN_FRESHNESS_MS) {
        watchdog_feed();
    }
    /* else: main is wedged — let the WDT fire (180 s budget). Don't LOG_WRN
     * here: if main really is hung, the log path may also be wedged. */
    k_work_reschedule(&wdt_feeder_work, K_MSEC(WDT_FEED_INTERVAL_MS));
}

/* -------------------------------------------------------------------------- */
/* External SPI NOR (Winbond W25Q128JV on the GPS-port pigtail)                 */
/* -------------------------------------------------------------------------- */
/* Fail-safe probe: the Zephyr spi_nor driver verifies the JEDEC ID against
 * the DTS-declared bytes on its own init. If the breakout isn't wired (or
 * the chip mis-IDs), device_is_ready() returns false and we just log the
 * absence. All future use (MCUboot Slot 1, golden-image, littlefs log
 * volume — see PLAN.md §3.5) is gated on ext_flash_present. */
/* Bind only when the DTS node is enabled. With status="disabled" (chip not
 * physically wired — see app.overlay), DEVICE_DT_GET would reference a
 * `__device_dts_ord_*` symbol the build system never emits → link error.
 * DT_NODE_HAS_STATUS gates on the actual binding. */
#if DT_NODE_HAS_STATUS(DT_NODELABEL(ext_flash), okay)
static const struct device *ext_flash_dev = DEVICE_DT_GET(DT_NODELABEL(ext_flash));
#else
static const struct device *ext_flash_dev = NULL;
#endif
static bool ext_flash_present = false;

static void ext_flash_probe(void)
{
    if (!ext_flash_dev) {
        LOG_WRN("ext_flash: DTS node missing — skipping probe");
        return;
    }
    if (!device_is_ready(ext_flash_dev)) {
        LOG_WRN("ext_flash: not detected on GPS-port SPI3 — FOTA/log-volume unavailable, continuing");
        return;
    }
    ext_flash_present = true;
    LOG_INF("ext_flash: %s ready (16 MB, jedec-id ef 40 18 — W25Q128JV)",
            ext_flash_dev->name);
}

extern "C" bool tinygs_ext_flash_present(void)
{
    return ext_flash_present;
}

/* -------------------------------------------------------------------------- */
/* Status LED (green, P1.03, active low)                                       */
/* -------------------------------------------------------------------------- */

static const struct gpio_dt_spec status_led = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);

#if defined(CONFIG_LED_STRIP)
static const struct device *led_strip = DEVICE_DT_GET_OR_NULL(DT_ALIAS(led_strip));
static struct led_rgb leds[2] = {{0}, {0}};
#else
static const void *led_strip = NULL;
#endif

static void led_init(void)
{
    /* Don't configure P1.03 as GPIO — PWM0 will own this pin for breathing LED.
     * The GPIO config would conflict with the PWM peripheral. */
#if defined(CONFIG_LED_STRIP)
    if (led_strip && device_is_ready(led_strip)) {
        /* Clear NeoPixels immediately — bootloader may have left them lit */
        struct led_rgb off[2] = {{0}, {0}};
        led_strip_update_rgb(led_strip, off, 2);
        LOG_INF("NeoPixel: 2x SK6812/WS2812 cleared");
    } else {
        led_strip = NULL;
    }
#endif
}

/* -------------------------------------------------------------------------- */
/* Breathing LED — nRF PWM hardware sequence, zero CPU                         */
/* -------------------------------------------------------------------------- */

#include <nrfx_pwm.h>
#include <nrfx_glue.h>   /* nrfx_isr — required for runtime IRQ binding */
#include <drivers/nrfx_errors.h> /* NRFX_SUCCESS — no longer pulled in transitively in v3.3 */
#include <hal/nrf_gpio.h>

static nrfx_pwm_t pwm_led = NRFX_PWM_INSTANCE(0);
static bool pwm_breathing = false;

/* Breathing LED: one gentle pulse, then 25s off, repeat.
 * Uses PWM event handler + k_timer for the pause (end_delay doesn't
 * work with NRFX_PWM_FLAG_LOOP). */
#define BREATH_MAX_DUTY  50    /* 5% max brightness */
#define BREATH_STEPS     64
#define BREATH_PAUSE_S   25    /* Seconds between pulses */
static nrf_pwm_values_individual_t breath_values[BREATH_STEPS];
static nrf_pwm_sequence_t breath_seq = {
    .values = { .p_individual = breath_values },
    .length = NRF_PWM_VALUES_LENGTH(breath_values),
    .repeats = 40,    /* Hold each step ~40ms. Pulse duration: 64*40ms ≈ 2.6s */
    .end_delay = 0,
};

static void breath_timer_handler(struct k_timer *timer);
static K_TIMER_DEFINE(breath_timer, breath_timer_handler, NULL);

static void breath_pwm_handler(nrfx_pwm_event_type_t event_type, void *p_context)
{
    if (event_type == NRFX_PWM_EVENT_FINISHED) {
        /* Pulse complete — start timer for the pause */
        k_timer_start(&breath_timer, K_SECONDS(BREATH_PAUSE_S), K_NO_WAIT);
    }
}

static void breath_timer_handler(struct k_timer *timer)
{
    /* Pause complete — play one more pulse */
    if (pwm_breathing) {
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0);
    }
}

static void breathing_led_init(void)
{
    /* Build breathing table. pin_inverted handles active-low LED,
     * so 0=off, BREATH_MAX_DUTY=max brightness. */
    for (int i = 0; i < BREATH_STEPS; i++) {
        int brightness = (i < 32) ? i : (63 - i);
        int duty = brightness * brightness * BREATH_MAX_DUTY / (31 * 31);
        breath_values[i].channel_0 = (uint16_t)duty;
        breath_values[i].channel_1 = 0;
        breath_values[i].channel_2 = 0;
        breath_values[i].channel_3 = 0;
    }

    nrfx_pwm_config_t config = {
        .output_pins = {
            NRF_GPIO_PIN_MAP(1, 3),  /* P1.03 = green LED */
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
        },
        .pin_inverted = { true, false, false, false }, /* Active LOW LED */
        .irq_priority = NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
        .base_clock   = NRF_PWM_CLK_1MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = 1000,
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO,
    };

