Bwooce/tinygs_nRF52/src/main.cpp
    /* Hook PWM0 IRQ vector to the nrfx dispatcher. Zephyr's nrfx
     * integration doesn't auto-connect when we use nrfx_pwm directly,
     * so the IRQ fires into a NULL vector → K_ERR_SPURIOUS_IRQ.
     * IRQ_CONNECT doesn't build in C++, so register dynamically.
     * Requires CONFIG_DYNAMIC_INTERRUPTS=y.
     *
     * In nrfx ≥ 3.x (NCS v3.3) the per-instance handlers
     * (nrfx_pwm_0_irq_handler etc.) were removed in favour of a single
     * nrfx_pwm_irq_handler(nrfx_pwm_t *) that needs the instance. The
     * Zephyr nrfx_isr trampoline calls the handler with NULL as the
     * context, so we wrap it to inject &pwm_led. */
    auto pwm_led_isr = +[](const void *unused) {
        ARG_UNUSED(unused);
        nrfx_pwm_irq_handler(&pwm_led);
    };
    irq_connect_dynamic(PWM0_IRQn,
                        NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
                        pwm_led_isr,
                        NULL,
                        0);
    irq_enable(PWM0_IRQn);
    if (nrfx_pwm_init(&pwm_led, &config, breath_pwm_handler, NULL) == NRFX_SUCCESS) {
        /* Play a single-step "off" sequence to ensure LED starts dark.
         * Without this, the PWM idle state may leave the pin floating. */
        static nrf_pwm_values_individual_t off_val = { 0, 0, 0, 0 };
        static nrf_pwm_sequence_t off_seq = {
            .values = { .p_individual = &off_val },
            .length = NRF_PWM_VALUES_LENGTH(off_val),
            .repeats = 0,
            .end_delay = 0,
        };
        nrfx_pwm_simple_playback(&pwm_led, &off_seq, 1, 0);
        LOG_INF("Breathing LED: PWM0 on P1.03");
    }
}

static void breathing_led_start(void)
{
    if (!pwm_breathing) {
        pwm_breathing = true;
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0); /* play once, handler restarts */
    }
}

static void breathing_led_stop(void)
{
    if (pwm_breathing) {
        pwm_breathing = false;
        k_timer_stop(&breath_timer);
        nrfx_pwm_stop(&pwm_led, false);
        /* PWM released — manually drive pin to turn LED off.
         * Active-low LED: HIGH = off */
        nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 3));
        nrf_gpio_pin_set(NRF_GPIO_PIN_MAP(1, 3));
    }
}

static void led_set(bool on)
{
    /* P1.03 is now PWM-driven (breathing LED). Use breathing_led_start/stop instead.
     * This function kept for error state where we want solid on/off. */
    (void)on;
}

/* NeoPixel colors — LED0=status (problems only), LED1=activity */
#define NEO_OFF       0, 0, 0
#define NEO_RED       20, 0, 0
#define NEO_GREEN     0, 10, 0
#define NEO_BLUE      0, 0, 20
#define NEO_YELLOW    15, 10, 0
#define NEO_WHITE     30, 30, 30

/* NeoPixel functions — no-ops when LED_STRIP is disabled */
static void neopixel_set(uint8_t r0, uint8_t g0, uint8_t b0,
                          uint8_t r1, uint8_t g1, uint8_t b1)
{
#if defined(CONFIG_LED_STRIP)
    if (!led_strip) return;
    leds[0].r = r0; leds[0].g = g0; leds[0].b = b0;
    leds[1].r = r1; leds[1].g = g1; leds[1].b = b1;
    led_strip_update_rgb(led_strip, leds, 2);
#endif
    (void)r0; (void)g0; (void)b0; (void)r1; (void)g1; (void)b1;
}

static void neopixel_off(void)
{
    neopixel_set(0, 0, 0, 0, 0, 0);
}

/* -------------------------------------------------------------------------- */
/* Battery Voltage ADC                                                         */
/* -------------------------------------------------------------------------- */

/* Battery ADC: P0.04 (AIN2), bias enable from DTS alias.
 * Voltage divider 100k:390k → multiplier ~4.9 */
static const struct gpio_dt_spec adc_ctrl = GPIO_DT_SPEC_GET(DT_ALIAS(adc_ctrl), gpios);

extern "C" int read_vbat_mv(void)
{
    const struct device *adc_dev = DEVICE_DT_GET(DT_NODELABEL(adc));
    if (!device_is_ready(adc_dev)) {
        return 3700;
    }

    /* Enable the voltage divider bias circuit */
    if (device_is_ready(adc_ctrl.port)) {
        gpio_pin_configure_dt(&adc_ctrl, GPIO_OUTPUT_ACTIVE);
        gpio_pin_set_dt(&adc_ctrl, 1);
        k_msleep(2);
    }

    /* input_positive is the SAADC channel index (NRF_SAADC_AINn = n), which
     * the nrfx driver maps to the PSEL register via nrfx_saadc_external_ain_psels[].
     * Do NOT use NRF_SAADC_INPUT_AINn here — that's the raw PSEL value and is
     * off-by-one on legacy nRF5x, so it silently selects the wrong pin. */
    struct adc_channel_cfg ch_cfg = {
        .gain = ADC_GAIN_1_6,
        .reference = ADC_REF_INTERNAL,
        .acquisition_time = ADC_ACQ_TIME_DEFAULT,
        .channel_id = 2,
        .input_positive = NRF_SAADC_AIN2, /* P0.04 */
    };
    adc_channel_setup(adc_dev, &ch_cfg);

    int16_t sample = 0;
    struct adc_sequence seq = {
        .channels = BIT(2),
        .buffer = &sample,
        .buffer_size = sizeof(sample),
        .resolution = 12,
    };

    int ret = adc_read(adc_dev, &seq);

    /* Disable bias to save power */
    if (device_is_ready(adc_ctrl.port)) {
        gpio_pin_set_dt(&adc_ctrl, 0);
    }

    if (ret != 0 || sample < 0) {
        LOG_WRN("ADC read failed: %d (sample=%d)", ret, sample);
        return 3700;
    }

    /* raw * (3600mV / 4096) * 4.9 */
    return (int)((float)sample * 3600.0f / 4096.0f * 4.9f);
}

/* -------------------------------------------------------------------------- */
/* Baud-Rate Reset Triggers                                                   */
/*                                                                            */
/* Non-standard rates 1201–1203 avoid Linux ModemManager probing (it cycles  */
/* 2400/4800/9600 on every new tty). Flash ops cannot run from the USB IRQ    */
/* context that fires the callback, so we defer to sysworkq.                  */
/* -------------------------------------------------------------------------- */

#define BAUD_RESET_UF2          1200  /* enter UF2 bootloader */
#define BAUD_RESET_WIPE_NVS     1201  /* erase OpenThread NVS partition */
#define BAUD_RESET_WIPE_CONFIG  1202  /* unlink /NAND:/config.json */
#define BAUD_RESET_FACTORY      1203  /* both: NVS + config.json */

static struct k_work reset_work;
static uint32_t reset_action_baud = 0;

