Bwooce/tinygs_nRF52/src/main.cpp
static void reset_work_handler(struct k_work *work)
{
    if (reset_action_baud == BAUD_RESET_WIPE_NVS ||
        reset_action_baud == BAUD_RESET_FACTORY) {
        LOG_INF("baud: erase OpenThread NVS (storage_partition)");
        const struct flash_area *fa;
        int rc = flash_area_open(FIXED_PARTITION_ID(storage_partition), &fa);
        if (rc == 0) {
            flash_area_erase(fa, 0, fa->fa_size);
            flash_area_close(fa);
            LOG_INF("NVS erase complete");
        } else {
            LOG_ERR("flash_area_open(storage_partition) failed: %d", rc);
        }
    }

    if (reset_action_baud == BAUD_RESET_WIPE_CONFIG ||
        reset_action_baud == BAUD_RESET_FACTORY) {
        LOG_INF("baud: unlink /NAND:/config.json");
        fs_unlink("/NAND:/config.json");
    }

    k_msleep(100); /* flush log + flash writes */
    sys_reboot(SYS_REBOOT_COLD);
}

static void baudrate_reset_handler(const struct device *dev, uint32_t baudrate)
{
    if (baudrate == BAUD_RESET_UF2) {
        /* No logging here — USB IRQ context, logging to USB would deadlock */
        nrf_power_gpregret_set(NRF_POWER, 0, 0x57);
        sys_reboot(SYS_REBOOT_COLD);
    } else if (baudrate == BAUD_RESET_WIPE_NVS ||
               baudrate == BAUD_RESET_WIPE_CONFIG ||
               baudrate == BAUD_RESET_FACTORY) {
        reset_action_baud = baudrate;
        k_work_submit(&reset_work);
    }
}

/* -------------------------------------------------------------------------- */
/* OpenThread                                                                  */
/* -------------------------------------------------------------------------- */

static const char *ot_role_str(otDeviceRole role)
{
    switch (role) {
    case OT_DEVICE_ROLE_DISABLED: return "Disabled";
    case OT_DEVICE_ROLE_DETACHED: return "Detached";
    case OT_DEVICE_ROLE_CHILD:    return "Child";
    case OT_DEVICE_ROLE_ROUTER:   return "Router";
    case OT_DEVICE_ROLE_LEADER:   return "Leader";
    default:                      return "Unknown";
    }
}

static void ot_state_changed_handler(otChangedFlags flags,
                                     struct openthread_context *ot_context,
                                     void *user_data)
{
    LOG_INF("ATTACH-DEBUG: ot_state_changed flags=0x%08x", (unsigned)flags);
    if (flags & OT_CHANGED_THREAD_ROLE) {
        static otDeviceRole prev_role = OT_DEVICE_ROLE_DISABLED;
        static int64_t detached_at_ms = 0;
        otDeviceRole role = otThreadGetDeviceRole(openthread_get_default_instance());

        bool was_attached = (prev_role == OT_DEVICE_ROLE_CHILD ||
                             prev_role == OT_DEVICE_ROLE_ROUTER ||
                             prev_role == OT_DEVICE_ROLE_LEADER);
        bool now_attached = (role == OT_DEVICE_ROLE_CHILD ||
                             role == OT_DEVICE_ROLE_ROUTER ||
                             role == OT_DEVICE_ROLE_LEADER);

        if (!was_attached && now_attached && detached_at_ms != 0) {
            int32_t detached_s = (int32_t)((k_uptime_get() - detached_at_ms) / 1000);
            LOG_WRN("Thread re-attached as %s after %ds detached",
                    ot_role_str(role), detached_s);
            detached_at_ms = 0;
        } else if (was_attached && !now_attached) {
            detached_at_ms = k_uptime_get();
            LOG_WRN("Thread parent lost (role: %s)", ot_role_str(role));
        } else {
            LOG_INF("Thread role: %s", ot_role_str(role));
        }

        thread_attached = now_attached;
        prev_role = role;
    }
}

static struct openthread_state_changed_cb ot_state_cb = {
    .state_changed_cb = ot_state_changed_handler,
};

static void dump_ot_dataset(struct openthread_context *ctx)
{
    otOperationalDataset dataset;
    otError err = otDatasetGetActive(openthread_get_default_instance(), &dataset);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("Failed to get active dataset: %d (%s)",
                (int)err, otThreadErrorToString(err));
        return;
    }

    LOG_INF("Active Dataset:");
    if (dataset.mComponents.mIsChannelPresent) {
        LOG_INF("  Channel: %u", dataset.mChannel);
    }
    if (dataset.mComponents.mIsPanIdPresent) {
        LOG_INF("  PAN ID: 0x%04x", dataset.mPanId);
    }
    if (dataset.mComponents.mIsExtendedPanIdPresent) {
        LOG_HEXDUMP_INF(dataset.mExtendedPanId.m8, 8, "  Ext PAN ID:");
    }
    if (dataset.mComponents.mIsNetworkKeyPresent) {
        LOG_HEXDUMP_INF(dataset.mNetworkKey.m8, 16, "  Network Key:");
    }
    if (dataset.mComponents.mIsNetworkNamePresent) {
        LOG_INF("  Network Name: %s", dataset.mNetworkName.m8);
    }
}

static void dump_ot_state(struct openthread_context *ctx)
{
    otInstance *inst = openthread_get_default_instance();

    LOG_INF("Thread state:");
    LOG_INF("  Role: %s", ot_role_str(otThreadGetDeviceRole(inst)));
    LOG_INF("  Interface up: %s", otIp6IsEnabled(inst) ? "yes" : "no");
    LOG_INF("  Thread enabled: %s", otThreadGetDeviceRole(inst) != OT_DEVICE_ROLE_DISABLED ? "yes" : "no");
    LOG_INF("  Channel: %u", otLinkGetChannel(inst));
    LOG_INF("  PAN ID: 0x%04x", otLinkGetPanId(inst));

    const otExtAddress *ext = otLinkGetExtendedAddress(inst);
    if (ext) {
        LOG_HEXDUMP_INF(ext->m8, 8, "  EUI-64:");
    }

    /* Print all unicast addresses */
    const otNetifAddress *addr = otIp6GetUnicastAddresses(inst);
    while (addr) {
        char buf[OT_IP6_ADDRESS_STRING_SIZE];
        otIp6AddressToString(&addr->mAddress, buf, sizeof(buf));
        LOG_INF("  IPv6 addr: %s", buf);
        addr = addr->mNext;
    }
}

static void log_ot_diagnostics(void)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        LOG_WRN("OT diagnostics: NULL context, skipping");
        return;
    }
    openthread_api_mutex_lock(ctx);
    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

/* Joiner retry.
 *
 * Single-shot joiner attempts NOT_FOUND when steering data from the
 * commissioner hasn't reached a router within radio earshot of us — common
 * when the OTBR is a peer router and the mesh leader is a closed-box BR
 * (Nest/HomePod) that doesn't propagate third-party commissioner steering
 * quickly. Retry indefinitely; once any attempt succeeds the dataset is
 * persisted in NVS and future boots attach directly.
 */
/* Short retry period: with the channel mask restricted to ch12 the joiner
 * discovery scan completes in ~300 ms (single OPENTHREAD_CONFIG_MAC_SCAN_
 * DURATION window). If the OTBR's MeshCoP beacon isn't transmitted within
 * that 300 ms, scan returns NotFound. OTBR beacons aren't frequent, so
 * we need many short re-scans to catch one. Retry every 5 s gives ~12
 * scans/min, statistically catching the beacon within ~1 min on first
 * boot. After a successful join the dataset persists to NVS and this
 * loop doesn't fire again. */
#define JOINER_RETRY_PERIOD_S 5

static struct k_work_delayable joiner_retry_work;
static atomic_t joiner_attempts = ATOMIC_INIT(0);

