Bwooce/tinygs_nRF52/src/main.cpp
static void joiner_retry_handler(struct k_work *work);

/* Conditional rx-on-when-idle for the joiner.
 *
 * The nRF radio is left rx-OFF-when-idle (sleepy) by OpenThread for our
 * MTD-non-SED device, so during the joiner DTLS "Connecting" wait the radio
 * sleeps and never receives the commissioner's reply (handshake times out →
 * Security). But forcing rx-on globally breaks the discovery scan (it needs
 * rx-off for channel hopping → NotFound). So we flip rx-on-when-idle ON only
 * while the joiner is in CONNECT/CONNECTED/ENTRUST, and OFF during
 * DISCOVER/IDLE. The DTLS retransmits at 8/16/32 s, so even if we set rx-on a
 * fraction of a second into CONNECT, a retransmitted flight's reply is caught.
 * Once committed+attached we keep rx-on permanently (MED, needs to receive). */
static struct k_work_delayable joiner_rxon_poll_work;
static bool joiner_rxon_applied = false;

/* Force the 802.15.4 radio's rx-on-when-idle directly at the driver level.
 * otThreadSetLinkMode() does NOT propagate to the radio for an unattached
 * joiner (verified: link-mode rx-on=1 leaves the driver at rx_on_when_idle=0),
 * so we drive IEEE802154_CONFIG_RX_ON_WHEN_IDLE ourselves. During the DTLS
 * connecting wait OT never touches this config (it only toggles it during the
 * channel-hopping scan), so a value we set here sticks. */
static void joiner_force_radio_rxon(bool on)
{
    const struct device *radio = DEVICE_DT_GET(DT_CHOSEN(zephyr_ieee802154));
    if (!device_is_ready(radio)) {
        return;
    }
    const struct ieee802154_radio_api *api =
        (const struct ieee802154_radio_api *)radio->api;
    if (!api || !api->configure) {
        return;
    }
    struct ieee802154_config cfg = {};
    cfg.rx_on_when_idle = on;
    int rc = api->configure(radio, IEEE802154_CONFIG_RX_ON_WHEN_IDLE, &cfg);
    LOG_INF("joiner-rxon: force radio rx_on_when_idle=%d rc=%d", (int)on, rc);
}

static void joiner_rxon_poll_handler(struct k_work *work)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        return;
    }
    openthread_api_mutex_lock(ctx);
    otInstance *inst = openthread_get_default_instance();
    bool want_rxon = false;
    bool commissioned = false;
    if (inst) {
        otJoinerState js = otJoinerGetState(inst);
        bool joiner_active = (js == OT_JOINER_STATE_CONNECT ||
                              js == OT_JOINER_STATE_CONNECTED ||
                              js == OT_JOINER_STATE_ENTRUST ||
                              js == OT_JOINER_STATE_JOINED);
        commissioned = otDatasetIsCommissioned(inst);
        /* The radio must be rx-on-when-idle whenever we are operational: a
         * commissioned MED — whether attached OR re-attaching — has to hear
         * Parent Responses and frame ACKs. It may only be rx-off during the
         * joiner DISCOVER scan (uncommissioned, needs channel hopping).
         * otThreadSetLinkMode does NOT propagate rx-on to the radio driver for
         * this MTD (the driver config does), so we drive the driver directly.
         * Earlier this only tracked the joiner state, so once the joiner went
         * IDLE post-join the driver was forced rx-OFF and never restored — the
         * MED then slept through every ACK/Parent Response (NoAck storms,
         * could not hold/recover attachment). Gating on `commissioned` keeps an
         * operational MED rx-on for its whole lifetime, including Detached
         * re-attach windows. */
        want_rxon = joiner_active || commissioned;
        if (commissioned) {
            otLinkModeConfig mode = otThreadGetLinkMode(inst);
            if (!mode.mRxOnWhenIdle) {
                mode.mRxOnWhenIdle = true;
                otThreadSetLinkMode(inst, mode);
            }
        }
    }
    openthread_api_mutex_unlock(ctx);

    /* Drive the radio config outside the OT mutex. Only act on a change so we
     * don't fight the scan's own toggling during DISCOVER. */
    if (inst && want_rxon != joiner_rxon_applied) {
        joiner_force_radio_rxon(want_rxon);
        joiner_rxon_applied = want_rxon;
    }

    /* Keep the poll alive for the device's lifetime — fast while still
     * commissioning (the joiner toggles rx quickly), slow steady re-assert once
     * operational so a later OT-driven rx-off can't permanently deafen us. */
    k_work_schedule(&joiner_rxon_poll_work,
                    commissioned ? K_SECONDS(1) : K_MSEC(150));
}

/* Comprehensively install + enable the OT operational dataset.
 *
 * Single helper called from all three "we have a dataset, now bring up
 * Thread" paths: init_openthread (NVS-loaded), joiner_callback (joiner just
 * succeeded), and joiner_retry_handler (saw PAN/Channel set, dataset must
 * be present internally).
 *
 * The point: don't whack-a-mole individual TLVs. Use the TLV-bytes round-
 * trip (otDatasetGetActiveTlvs → otDatasetSetActiveTlvs) so every TLV the
 * dataset has — Channel/PAN/Key/XPan/MLP/Name/Pskc/SecPol/ActiveTs/ChMask
 * — gets re-applied to OT's internal subsystems in one shot. Bypasses the
 * mIs*Present-flag-fragility on the struct-form API. Also dump a one-line
 * dataset state so we can see what stuck.
 *
 * Caller must hold the OT API mutex. */
static void ot_install_active_and_enable(otInstance *inst, const char *tag)
{
    /* Don't otJoinerStop() — it can tear down joiner state that MLE's first
     * timer still references, leading to a NULL fn ptr crash on MPSL Work
     * when that timer fires. If the joiner is still running, our SetEnabled
     * will return Busy and we'll be retried; better than crashing. */

    /* Probe every store OT exposes. Pending dataset is where the joiner
     * staging data and any delayed network-key migration sits before being
     * promoted to Active. If only Pending has TLVs, that's the bug — joiner
     * stored to Pending but never committed to Active. */
    otOperationalDatasetTlvs at = {};
    otOperationalDatasetTlvs pt = {};
    otError e_at = otDatasetGetActiveTlvs(inst, &at);
    otError e_pt = otDatasetGetPendingTlvs(inst, &pt);
    LOG_INF("DS(%s): activeTlvs rc=%d len=%u  pendingTlvs rc=%d len=%u  isCommissioned=%d",
            tag, (int)e_at, (unsigned)at.mLength,
            (int)e_pt, (unsigned)pt.mLength,
            (int)otDatasetIsCommissioned(inst));

    /* Promote Pending to Active if Pending has bytes and Active doesn't. */
    if ((e_at != OT_ERROR_NONE || at.mLength == 0) &&
        e_pt == OT_ERROR_NONE && pt.mLength > 0) {
        otError e_set = otDatasetSetActiveTlvs(inst, &pt);
        LOG_INF("DS(%s): promoted Pending->Active rc=%d (%s)",
                tag, (int)e_set, otThreadErrorToString(e_set));
    } else if (e_at == OT_ERROR_NONE && at.mLength > 0) {
        /* Active already populated — round-trip to force re-application. */
        otError e_set = otDatasetSetActiveTlvs(inst, &at);
        LOG_INF("DS(%s): Active round-trip rc=%d (%s)",
                tag, (int)e_set, otThreadErrorToString(e_set));
    } else {
        LOG_WRN("DS(%s): no TLVs in Active or Pending — nothing to install",
                tag);
    }

