Bwooce/tinygs_nRF52/src/main.cpp
    /* Live-state diagnostic — what OT actually has now after the round-trip. */
    otPanId panid = otLinkGetPanId(inst);
    uint8_t chan = otLinkGetChannel(inst);
    const otExtendedPanId *xp = otThreadGetExtendedPanId(inst);
    const otMeshLocalPrefix *ml = otThreadGetMeshLocalPrefix(inst);
    const char *netname = otThreadGetNetworkName(inst);
    LOG_INF("DS(%s): PAN=0x%04x ch=%u name=%s xpan=%02x%02x%02x%02x%02x%02x%02x%02x mlp=%02x%02x:%02x%02x:%02x%02x:%02x%02x::",
            tag, (unsigned)panid, (unsigned)chan,
            netname ? netname : "(null)",
            xp->m8[0], xp->m8[1], xp->m8[2], xp->m8[3],
            xp->m8[4], xp->m8[5], xp->m8[6], xp->m8[7],
            ml->m8[0], ml->m8[1], ml->m8[2], ml->m8[3],
            ml->m8[4], ml->m8[5], ml->m8[6], ml->m8[7]);

    /* Enable IP6 and Thread. Order matters: IP6 first, then Thread. */
    otError e_ip6 = otIp6SetEnabled(inst, true);
    otError e_thr = otThreadSetEnabled(inst, true);
    LOG_INF("DS(%s): otIp6SetEnabled=%d otThreadSetEnabled=%d (%s)",
            tag, (int)e_ip6, (int)e_thr, otThreadErrorToString(e_thr));
}

static void joiner_callback(otError error, void *context)
{
    struct openthread_context *ctx = openthread_get_default_context();

    if (error == OT_ERROR_NONE) {
        int n = atomic_get(&joiner_attempts) + 1;
        LOG_INF("=== Joiner succeeded on attempt %d — enabling Thread ===", n);
        otInstance *inst = ctx ? openthread_get_default_instance() : NULL;
        if (!ctx || !inst) {
            LOG_ERR("Joiner callback: NULL OT context/instance — cannot start Thread.");
            return;
        }
        /* OT callbacks fire from the OT thread, which already holds the API
         * mutex — taking it again would deadlock.
         *
         * Joiner::Finish has just torn down the SecureAgent and reset its
         * mTimer; the dataset is already SaveLocal()'d to NVS by the JOIN_ENT
         * handler. DO NOT re-enter ot_install_active_and_enable here — its
         * otDatasetSetActiveTlvs round-trip re-imports the dataset while MLE
         * is mid-attach and the joiner's mTimer/k_work hasn't been fully
         * disarmed in mpsl_work_q, causing a NULL fn-ptr crash on MPSL Work
         * (work struct inside ot::gInstanceRaw, handler cleared by Stop()).
         * Just enable Thread — IPv6 is already on (we did it before joiner
         * start). MLE will attach using the dataset Joiner saved. */
        otError e_thr = otThreadSetEnabled(inst, true);
        LOG_INF("joiner-cb: otThreadSetEnabled rc=%d (%s)",
                (int)e_thr, otThreadErrorToString(e_thr));
        return;
    }

    int n = atomic_inc(&joiner_attempts) + 1;
    LOG_ERR("Joiner attempt %d failed: %d (%s) — retry in %ds",
            n, (int)error, otThreadErrorToString(error), JOINER_RETRY_PERIOD_S);
    k_work_schedule(&joiner_retry_work, K_SECONDS(JOINER_RETRY_PERIOD_S));
}

static void joiner_retry_handler(struct k_work *work)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        k_work_schedule(&joiner_retry_work, K_SECONDS(JOINER_RETRY_PERIOD_S));
        return;
    }

    openthread_api_mutex_lock(ctx);
    otInstance *inst = openthread_get_default_instance();
    if (!inst) {
        openthread_api_mutex_unlock(ctx);
        k_work_schedule(&joiner_retry_work, K_SECONDS(JOINER_RETRY_PERIOD_S));
        return;
    }

    /* "Dataset present" must mean a real commissioned dataset (network key
     * persisted in NVS), NOT just leftover PAN/Channel from a previous
     * joiner discovery scan. otLinkGetPanId/Channel return the cached scan
     * result even when no dataset is committed — mis-detecting "present"
     * here causes the retry to skip the next joiner attempt entirely.
     * otDatasetIsCommissioned() is the authoritative signal. */
    if (otDatasetIsCommissioned(inst)) {
        LOG_INF("joiner retry: dataset committed (PAN 0x%04x ch %u), enabling Thread",
                (unsigned)otLinkGetPanId(inst), (unsigned)otLinkGetChannel(inst));
        otError e_ip6 = otIp6SetEnabled(inst, true);
        otError e_thr = otThreadSetEnabled(inst, true);
        LOG_INF("joiner retry: otIp6SetEnabled=%d otThreadSetEnabled=%d (%s)",
                (int)e_ip6, (int)e_thr, otThreadErrorToString(e_thr));
        openthread_api_mutex_unlock(ctx);
        return;
    }

        LOG_INF("Supported channel mask: 0x%08X", (unsigned int)otLinkGetSupportedChannelMask(inst));
    otError err = otJoinerStart(inst,
                                TINYGS_JOINER_PSKD,
                                NULL, NULL, NULL, NULL, NULL,
                                joiner_callback, NULL);
    openthread_api_mutex_unlock(ctx);

    if (err == OT_ERROR_NONE) {
        LOG_INF("joiner retry #%d started", (int)atomic_get(&joiner_attempts) + 1);
        k_work_schedule(&joiner_rxon_poll_work, K_MSEC(100));
    } else if (err == OT_ERROR_BUSY) {
        LOG_WRN("joiner retry: Busy, recheck in 15s");
        k_work_schedule(&joiner_retry_work, K_SECONDS(15));
    } else {
        LOG_ERR("joiner retry: otJoinerStart err=%d (%s), retry in %ds",
                (int)err, otThreadErrorToString(err), JOINER_RETRY_PERIOD_S);
        k_work_schedule(&joiner_retry_work, K_SECONDS(JOINER_RETRY_PERIOD_S));
    }
}

static void init_openthread(void)
{
    struct openthread_context *ctx = openthread_get_default_context();
    if (!ctx) {
        LOG_ERR("OpenThread context is NULL — net stack not initialised? Aborting OT init.");
        return;
    }

    /* v3.3 the L2 layer no longer populates openthread_context.instance;
     * the singleton instance comes from openthread_get_default_instance().
     * Pre-flight check that it's available before we start. */
    if (!openthread_get_default_instance()) {
        LOG_ERR("openthread_get_default_instance() returned NULL — OT not initialised yet.");
        return;
    }

    LOG_INF("Starting OpenThread (Joiner mode)...");
    openthread_state_changed_cb_register(ctx, &ot_state_cb);
    k_work_init_delayable(&joiner_retry_work, joiner_retry_handler);
    k_work_init_delayable(&joiner_rxon_poll_work, joiner_rxon_poll_handler);

    /* DO NOT call openthread_start(ctx). It's a deprecated alias for
     * openthread_run() which bypasses CONFIG_OPENTHREAD_MANUAL_START and
     * fires Zephyr's own platform joiner (using ot_joiner_start_handler).
     * That created a race: platform joiner runs with its callback, ours
     * BUSYs out and never installs, and any post-join cleanup goes via
     * paths we don't control. With MANUAL_START=y, openthread_init() has
     * already allocated the instance, started openthread_work_q, and
     * registered the L2 state-changed handler at sys_init — we just need
     * to enable Ip6 + start our own joiner. */

    openthread_api_mutex_lock(ctx);
    otInstance *inst = openthread_get_default_instance();
    if (!inst) {
        LOG_ERR("OpenThread instance is NULL — bailing.");
        openthread_api_mutex_unlock(ctx);
        return;
    }

    /* Check for a persisted, commissioned dataset first. */
    if (otDatasetIsCommissioned(inst)) {
        LOG_INF("Found committed dataset — enabling Thread directly");
        dump_ot_dataset(ctx);
        otError e_ip6 = otIp6SetEnabled(inst, true);
        otError e_thr = otThreadSetEnabled(inst, true);
        LOG_INF("init: otIp6SetEnabled=%d otThreadSetEnabled=%d (%s)",
                (int)e_ip6, (int)e_thr, otThreadErrorToString(e_thr));
        /* Booting straight from a stored dataset (no joiner this boot) — start
         * the rx-on poll so the operational MED's radio is driven rx-on-when-
         * idle. Without this the driver stays rx-off and the MED sleeps through
         * ACKs / Parent Responses and can never attach. */
        k_work_schedule(&joiner_rxon_poll_work, K_MSEC(100));
    } else {
        LOG_INF("No committed dataset — starting Joiner with PSKd");

        otIp6SetEnabled(inst, true);

