Bwooce/tinygs_nRF52/src/main.cpp
        LOG_INF("Supported channel mask: 0x%08X", (unsigned int)otLinkGetSupportedChannelMask(inst));
        otError err = otJoinerStart(inst,
                                    TINYGS_JOINER_PSKD,  /* PSKd */
                                    NULL,   /* provisioning URL */
                                    NULL,   /* vendor name */
                                    NULL,   /* vendor model */
                                    NULL,   /* vendor sw version */
                                    NULL,   /* vendor data */
                                    joiner_callback, NULL);

        if (err == OT_ERROR_NONE) {
            LOG_INF("Joiner started, waiting for commissioner (PSKd: %s)...",
                    TINYGS_JOINER_PSKD);
            k_work_schedule(&joiner_rxon_poll_work, K_MSEC(100));
        } else {
            LOG_ERR("otJoinerStart failed: %d (%s) — retry in %ds",
                    (int)err, otThreadErrorToString(err), JOINER_RETRY_PERIOD_S);
            k_work_schedule(&joiner_retry_work, K_SECONDS(JOINER_RETRY_PERIOD_S));
        }
    }

    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

/* Build a NAT64-synthesised IPv6 peer from the mesh's favored NAT64
 * prefix (read live from Thread netdata) and a caller-supplied IPv4
 * literal. Returns true and fills *out on success; false if no NAT64
 * route is present. Used by both the DNS and SNTP sync paths to avoid
 * ULA→global egress, which OT BorderRouting ICMP-rejects. */
static bool nat64_synth(otInstance *instance, const uint8_t ipv4[4],
                        otIp6Address *out)
{
    otNetworkDataIterator it = OT_NETWORK_DATA_ITERATOR_INIT;
    otExternalRouteConfig route;
    while (otNetDataGetNextRoute(instance, &it, &route) == OT_ERROR_NONE) {
        if (route.mNat64 && route.mPrefix.mLength == 96) {
            *out = route.mPrefix.mPrefix;
            memcpy(&out->mFields.m8[12], ipv4, 4);
            return true;
        }
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* DNS Resolution via OpenThread DNS client (NAT64)                            */
/* -------------------------------------------------------------------------- */

static K_SEM_DEFINE(dns_sem, 0, 1);
static volatile int dns_result = -1;
/* Serialises resolve_ipv4_hostname() — main thread (MQTT reconnect) and
 * system workqueue (daily SNTP resync) can both call it. Without this,
 * the second caller's k_sem_reset() corrupts the first's wait, and the
 * dns_callback writes whichever dns_ctx* arrived second into the wrong
 * caller's *out. Hold time = single DNS round-trip, ≤15 s. */
static K_MUTEX_DEFINE(dns_mutex);

/* Shared resolver-callback context. Stack allocation is unsafe because
 * the query can timeout in k_sem_take, leaving the OT stack with a pointer
 * to a destroyed stack frame. Using a static struct protected by dns_mutex,
 * plus a query generation ID, prevents use-after-free and cross-talk
 * (a late callback from a timed-out query unblocking a new query). */
struct dns_ctx {
    otIp6Address *out;
    const char  *hostname;
};
static struct dns_ctx current_dctx;
static uint32_t current_dns_id = 0;

static void dns_callback(otError aError, const otDnsAddressResponse *aResponse, void *aContext)
{
    uint32_t id = (uint32_t)(uintptr_t)aContext;
    if (id != current_dns_id) {
        LOG_WRN("Ignoring late DNS callback for ID %u (current %u)", id, current_dns_id);
        return;
    }

    if (aError != OT_ERROR_NONE) {
        LOG_ERR("OT DNS callback error: %d (%s)", (int)aError, otThreadErrorToString(aError));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    otIp6Address addr;
    uint32_t ttl;
    otError err = otDnsAddressResponseGetAddress(aResponse, 0, &addr, &ttl);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("OT DNS no address in response: %d (%s)", (int)err, otThreadErrorToString(err));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    if (current_dctx.out) {
        *current_dctx.out = addr;
    }

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&addr, addr_str, sizeof(addr_str));
    LOG_INF("Resolved %s -> [%s] (TTL=%u)",
            current_dctx.hostname ? current_dctx.hostname : "?", addr_str, (unsigned)ttl);

    dns_result = 0;
    k_sem_give(&dns_sem);
}

/* Generic hostname → NAT64-synthesised IPv6 resolver. Used by the MQTT
 * broker and SNTP paths — anywhere we need to reach an IPv4-only host
 * from the Thread mesh. Returns 0 on success and fills *out; -1 on any
 * failure. Blocks up to 15 s waiting on the DNS callback. */
static int resolve_ipv4_hostname(const char *hostname, otIp6Address *out)
{
    struct openthread_context *ctx = openthread_get_default_context();

    /* Lock for the whole resolve so dns_sem / dns_result / dns_callback
     * can't be co-opted by an overlapping caller. Hold ≤15 s. */
    k_mutex_lock(&dns_mutex, K_FOREVER);

    k_sem_reset(&dns_sem);
    dns_result = -1;
    current_dns_id++;
    current_dctx.out = out;
    current_dctx.hostname = hostname;

    otDnsQueryConfig config;
    memset(&config, 0, sizeof(config));
    static const uint8_t dns_v4[4] = TINYGS_DNS_SERVER_V4;
    openthread_api_mutex_lock(ctx);
    bool found = nat64_synth(openthread_get_default_instance(), dns_v4, &config.mServerSockAddr.mAddress);
    openthread_api_mutex_unlock(ctx);
    if (!found) {
        LOG_ERR("No /96 NAT64 route in Thread netdata — mesh has no NAT64 translator?");
        k_mutex_unlock(&dns_mutex);
        return -1;
    }
    config.mServerSockAddr.mPort    = TINYGS_DNS_SERVER_PORT;
    config.mResponseTimeout         = 10000;
    config.mMaxTxAttempts           = 3;
    config.mRecursionFlag           = OT_DNS_FLAG_RECURSION_DESIRED;
    config.mNat64Mode               = OT_DNS_NAT64_ALLOW;

    char dns_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&config.mServerSockAddr.mAddress, dns_str, sizeof(dns_str));
    LOG_INF("Resolving %s via NAT64-synthesised DNS [%s]:53",
            hostname, dns_str);

    /* Query A record (IPv4) explicitly. IPv4-only hosts return NotFound
     * for AAAA queries. With mNat64Mode=ALLOW and a NAT64 prefix in
     * netdata, OT synthesises an AAAA from the A response — we get back
     * a NAT64-prefixed address directly usable as a peer. */
    openthread_api_mutex_lock(ctx);
    otError err = otDnsClientResolveIp4Address(openthread_get_default_instance(),
                                               hostname,
                                               dns_callback, (void *)(uintptr_t)current_dns_id,
                                               &config);
    openthread_api_mutex_unlock(ctx);

