Bwooce/tinygs_nRF52/src/main.cpp
                    /* Shut down every peripheral that keeps a clock on. The
                     * previous version left OpenThread rx-on (~5–6 mA), USB
                     * holding HFCLK up (~1–2 mA) and PWM running — k_sleep()
                     * on its own does very little for us. Order matters:
                     * MQTT disconnect first so the broker sees a clean drop,
                     * radio next since it's the biggest draw, then the rest.
                     * sys_reboot() on wake means we can be dirty here. */
                    mqtt_disconnect(client, NULL);
                    k_msleep(200);

                    if (radio) radio->sleep();

                    struct openthread_context *ot_ctx =
                        openthread_get_default_context();
                    if (ot_ctx) {
                        openthread_api_mutex_lock(ot_ctx);
                        otThreadSetEnabled(openthread_get_default_instance(), false);
                        otIp6SetEnabled(openthread_get_default_instance(), false);
                        openthread_api_mutex_unlock(ot_ctx);
                    }

                    /* USB holds HFCLK on whenever it's enabled — releasing
                     * it lets the SoC drop to LFCLK during k_sleep(). */
                    usb_disable();

                    /* Release the PWM peripheral so it stops requesting
                     * its clock. Also kills the breathing LED, fine, the
                     * device is supposed to look off. */
                    nrfx_pwm_uninit(&pwm_led);

                    k_sleep(K_SECONDS(secs));

                    LOG_INF("  → wake — rebooting");
                    sys_reboot(SYS_REBOOT_COLD);
                }
            } else if (strcmp(cmnd, "foff") == 0) {
                float foff = tinygs_parse_foff((char *)rx_payload, ret,
                                                &tinygs_radio.doppler_tol,
                                                &doppler_interval_ms);
                tinygs_radio.freq_offset = foff;
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → foff=%.0f Hz tol=%.0f Hz refresh=%ums",
                        (double)foff, (double)tinygs_radio.doppler_tol,
                        (unsigned)doppler_interval_ms);
            } else if (strcmp(cmnd, "filter") == 0) {
                int fcount = tinygs_parse_filter((char *)rx_payload, ret,
                                                  tinygs_radio.filter,
                                                  sizeof(tinygs_radio.filter));
                tinygs_radio.filter_len = (fcount > 0) ? fcount : 0;
                LOG_INF("  → filter: %d bytes", tinygs_radio.filter_len);
            } else if (strcmp(cmnd, "update") == 0) {
                /* Server pushes a URL pointing at a new firmware image.
                 * On our hardware there is no network-OTA path: the
                 * Adafruit UF2 bootloader requires a physical USB mass-
                 * storage copy of a .uf2 file. We log the URL so the
                 * operator can fetch and flash it manually. A future
                 * MCUboot-based variant could fetch via CoAP over Thread
                 * and stage into slot1; that's a hardware change, not a
                 * code change in this firmware. */
                if (ret > 0) {
                    /* Payload is not guaranteed NUL-terminated — copy to bounded buf */
                    char url[128];
                    size_t n = ((size_t)ret < sizeof(url) - 1) ? (size_t)ret
                                                              : sizeof(url) - 1;
                    memcpy(url, rx_payload, n);
                    url[n] = '\0';
                    LOG_INF("  → update URL: %s", url);
                    LOG_INF("  → (UF2 bootloader: fetch + drag-and-drop to HT-n5262 to apply)");
                } else {
                    LOG_INF("  → update: (empty payload)");
                }
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else if (strcmp(cmnd, "sat_pos_oled") == 0) {
                /* Satellite position for world map: [x, y] in 128x64 pixel coords */
                const char *p = strchr((char *)rx_payload, '[');
                if (p) {
                    p++;
                    tinygs_radio.sat_pos_x = strtof(p, (char **)&p);
                    while (*p == ',' || *p == ' ') p++;
                    tinygs_radio.sat_pos_y = strtof(p, NULL);
                }
                LOG_DBG("  → sat_pos: %.0f,%.0f",
                        (double)tinygs_radio.sat_pos_x,
                        (double)tinygs_radio.sat_pos_y);
            } else if (strncmp(cmnd, "frame/", 6) == 0) {
                int frame_num = atoi(cmnd + 6);
                tinygs_display_set_remote_frame(frame_num,
                                                 (const char *)rx_payload, ret);
                /* Server pushes frame/0 in two stages for every RX'd packet:
                 * first with sat="UNKNOWN", status="UNKNOWN" ("got your bytes,
                 * haven't decoded yet"), then ~10s later sat="<real name>",
                 * status="CONFIRMED" after decode + cross-reference with other
                 * stations. If CONFIRMED never arrives the packet wasn't
                 * decodable. Labeling the stage here makes it easy to spot
                 * non-confirmed packets in the log. */
                const char *stage = strstr((char *)rx_payload, "CONFIRMED")
                                        ? "CONFIRMED"
                                    : strstr((char *)rx_payload, "UNKNOWN")
                                        ? "pending(UNKNOWN)"
                                        : "unlabelled";
                LOG_INF("  → frame/%d stage=%s", frame_num, stage);
            } else if (strcmp(cmnd, "frame") == 0) {
                LOG_DBG("  → frame command without number, ignored");
            } else if (strcmp(cmnd, "set_adv_prm") == 0) {
                /* Server pushes an advanced-params JSON blob. Store it opaquely;
                 * ESP32 parses it into ConfigManager but we have no concrete use
                 * for the fields yet — keep the raw string so get_adv_prm can
                 * echo it back. */
                size_t n = (ret < (int)sizeof(cfg_adv_prm) - 1) ? (size_t)ret
                                                                : sizeof(cfg_adv_prm) - 1;
                memcpy(cfg_adv_prm, rx_payload, n);
                cfg_adv_prm[n] = '\0';
                LOG_INF("  → set_adv_prm stored (%zu bytes)", n);
            } else if (strcmp(cmnd, "get_adv_prm") == 0) {
                /* Server asks us to echo our current adv_prm. Publish to
                 * tele/get_adv_prm (ESP32 uses the same topic for response). */
                tinygs_send_adv_prm(client, cfg_mqtt_user, cfg_station, cfg_adv_prm);
                LOG_INF("  → get_adv_prm responded");
            } else if (strcmp(cmnd, "remoteTune") == 0) {
                /* Newer server command — payload is a single number applied as
                 * an additional freq offset in Hz. */
                float off = strtof((char *)rx_payload, NULL);
                tinygs_radio.freq_offset = off;
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → remoteTune offset=%.0f Hz", (double)off);
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

