Bwooce/tinygs_nRF52/src/main.cpp
static void early_log_appendf(const char *fmt, ...)
{
    if (!early_log_active) return;
    /* Reserve room for at least one line (~96 B) including newline. */
    if (early_log_pos + 96 >= EARLY_LOG_BUF_SIZE) return;

    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(early_log_buf + early_log_pos,
                      EARLY_LOG_BUF_SIZE - early_log_pos - 1,
                      fmt, ap);
    va_end(ap);
    if (n <= 0) return;

    early_log_pos += (size_t)n;
    if (early_log_pos < EARLY_LOG_BUF_SIZE - 1) {
        early_log_buf[early_log_pos++] = '\n';
    }
    early_log_buf[early_log_pos] = '\0';
}

#define EARLY_LOG(fmt, ...) early_log_appendf(fmt, ##__VA_ARGS__)

/* Replay buffered early-boot lines via LOG_INF after DTR-assert.
 * Call exactly once after the DTR-wait loop in main(). */
static void early_log_dump(void)
{
    if (!early_log_active) return;
    early_log_active = false;
    if (early_log_pos == 0) return;

    LOG_INF("--- early-boot log (buffered before USB host opened the port) ---");
    char *p = early_log_buf;
    char *end = early_log_buf + early_log_pos;
    while (p < end) {
        char *nl = (char *)memchr(p, '\n', end - p);
        if (!nl) {
            LOG_INF("%s", p);
            break;
        }
        *nl = '\0';
        LOG_INF("%s", p);
        p = nl + 1;
    }
    LOG_INF("--- end early-boot log ---");
    early_log_pos = 0;
}

/* USB VBUS state tracking — only enable USB stack when a cable is present.
 * Saves ~1 mA on battery by letting HFXO release when USBD is disabled.
 * Polled from the main loop with a debounce so a flaky cable doesn't
 * thrash the stack. */
static bool usb_is_enabled = false;
static bool last_vbus_state = false;
static uint32_t vbus_change_ms = 0;
#define USB_VBUS_DEBOUNCE_MS 2000

static inline bool usb_vbus_present(void)
{
    return (NRF_POWER->USBREGSTATUS & POWER_USBREGSTATUS_VBUSDETECT_Msk) != 0;
}

/* Public wrapper, declared earlier near tinygs_mqtt_is_connected. */
extern "C" bool tinygs_usb_vbus_present(void)
{
    return usb_vbus_present();
}

/* Forward declare — defined later, after the FATFS mount struct exists. */
static bool usb_detach_config_changed(void);

/* VBUS poll runs on the system workqueue so hot-plug detection works
 * regardless of where the connection state machine is parked. The
 * MQTT-loop variant only fired in STATE_MQTT_CONNECTED — meaning a
 * device stuck in STATE_WAIT_THREAD or STATE_ERROR after a BR outage
 * would never see the user plug in to debug. */
#define USB_VBUS_POLL_MS  250  /* 4 Hz — debounce window holds 8 samples */
static void usb_vbus_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(usb_vbus_work, usb_vbus_work_handler);

static void usb_vbus_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);

    bool now_present = usb_vbus_present();
    uint32_t now_ms = k_uptime_get_32();

    if (now_present != last_vbus_state) {
        last_vbus_state = now_present;
        vbus_change_ms = now_ms;
    } else if (now_present != usb_is_enabled &&
               (now_ms - vbus_change_ms) >= USB_VBUS_DEBOUNCE_MS) {
        if (now_present) {
            if (usb_enable(NULL) == 0) {
                usb_is_enabled = true;
                LOG_INF("USB cable detected — stack enabled (MSC + CDC ACM)");
            } else {
                LOG_WRN("USB cable detected but usb_enable() failed");
            }
        } else {
            usb_disable();
            usb_is_enabled = false;
            LOG_INF("USB cable removed — stack disabled (~1 mA saved)");

            /* If the host edited config.json during this USB session, the
             * device's NVS still holds the old values (FATFS writes go
             * directly to flash via MSC, never through our settings layer
             * while the drive is mounted). Re-read the file and compare
             * against cfg_last_snapshot — if it changed, reboot so the
             * snapshot-diff sync in setup_usb_storage applies the edits.
             * If unchanged, stay running (avoids spurious reboots when the
             * user just plugged in to view logs). */
            if (usb_detach_config_changed()) {
                LOG_INF("Config changed during USB session — rebooting to apply");
                k_msleep(200);   /* let log + USB-down state flush */
                sys_reboot(SYS_REBOOT_COLD);
            }
        }
    }

    k_work_reschedule(&usb_vbus_work, K_MSEC(USB_VBUS_POLL_MS));
}

static void setup_usb_storage(void)
{
    struct fs_file_t file;
    struct fs_dirent entry;

    EARLY_LOG("Mounting FATFS...");

    /* Check FAT boot sector signature BEFORE mounting. FatFs will crash
     * (HardFault) on corrupted FAT data because it follows garbage pointers.
     * Reading raw flash is safe — no FatFs code involved. If invalid,
     * format through the disk driver (which manages the write cache). */
    {
        const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));
        uint8_t sig[2];
        flash_read(flash_dev, 0xE2000 + 510, sig, 2);
        if (sig[0] == 0xFF && sig[1] == 0xFF) {
            /* Erased flash — fs_mount with MOUNT_MKFS will auto-format */
            LOG_INF("FATFS: partition erased, will auto-format on mount");
        } else if (sig[0] != 0x55 || sig[1] != 0xAA) {
            /* Corrupted data — erase partition and reboot to avoid FatFs crash */
            EARLY_LOG("WRN FATFS: corrupt boot sector (0x%02X 0x%02X), erasing",
                    sig[0], sig[1]);
            flash_erase(flash_dev, 0xE2000, 0x6000);
            LOG_INF("Partition erased, rebooting...");
            k_msleep(100);
            sys_reboot(SYS_REBOOT_COLD);
        }
    }

    int res = fs_mount(&mp);
    EARLY_LOG("FATFS mount: %d (%s)", res, res < 0 ? errno_name(res) : "OK");

    if (res == 0) {
        /* Write index.html with commissioning info (only if missing) */
        if (fs_stat("/NAND:/index.html", &entry) != 0) {
            /* Get EUI-64 for commissioning info */
            extern char device_client_id[13];
            if (device_client_id[0] == '\0') {
                uint64_t dev_id = NRF_FICR->DEVICEID[0] |
                                  ((uint64_t)NRF_FICR->DEVICEID[1] << 32);
                snprintf(device_client_id, sizeof(device_client_id),
                         "%04X%08X", (unsigned)(dev_id >> 32), (unsigned)dev_id);
            }

