Bwooce/tinygs_nRF52/src/main.cpp
            DIFF_AND_APPLY_STR("\"station\":\"", cfg_station,
                tinygs_config_save_station(cfg_station));
            DIFF_AND_APPLY_STR("\"mqtt_user\":\"", cfg_mqtt_user,
                tinygs_config_save("user", cfg_mqtt_user, strlen(cfg_mqtt_user)));
            DIFF_AND_APPLY_STR("\"mqtt_pass\":\"", cfg_mqtt_pass,
                tinygs_config_save("pass", cfg_mqtt_pass, strlen(cfg_mqtt_pass)));

            /* tx_enable — JSON bool. Match against snapshot the same way. */
            if (have_file) {
                int fv = json_extract_bool(file_buf, "\"tx_enable\":", -1);
                int sv = have_snapshot ?
                    json_extract_bool(cfg_last_snapshot, "\"tx_enable\":", -1) :
                    -1;
                bool edited = have_snapshot ? (fv != sv) : (fv != -1);
                if (edited && fv != -1) {
                    EARLY_LOG("Config: user edit 'tx_enable' %d -> %d, persisting",
                            (int)cfg_tx_enable, fv);
                    cfg_tx_enable = (int8_t)fv;
                    int8_t v = cfg_tx_enable;
                    tinygs_config_save("tx", &v, sizeof(v));
                    edits++;
                }
            }

            #undef DIFF_AND_APPLY_FLOAT
            #undef DIFF_AND_APPLY_STR

            if (edits > 0) {
                EARLY_LOG("Config: applied %d user edit(s) from config.json", edits);
            } else if (have_file) {
                EARLY_LOG("Config: no user edits since last write");
            } else {
                EARLY_LOG("Config: no config.json on drive — will create from current state");
            }

            /* Always rewrite config.json from current memory (which now
             * reflects NVS state plus any user edits we just absorbed)
             * and snapshot it, so next boot's diff has a fresh baseline. */
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_CREATE | FS_O_WRITE) == 0) {
                int len = snprintf(file_buf, sizeof(file_buf),
                    "{\n"
                    "  \"station\": \"%s\",\n"
                    "  \"mqtt_user\": \"%s\",\n"
                    "  \"mqtt_pass\": \"%s\",\n"
                    "  \"lat\": %.4f,\n"
                    "  \"lon\": %.4f,\n"
                    "  \"alt\": %.0f,\n"
                    "  \"display_timeout\": 30,\n"
                    "  \"tx_enable\": %s\n"
                    "}\n",
                    cfg_station, cfg_mqtt_user, cfg_mqtt_pass,
                    (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt,
                    cfg_tx_enable ? "true" : "false");
                /* snprintf returns the would-have-written length, which
                 * can exceed the buffer if a future field bloats things.
                 * Cap to actual buffer fill so fs_write can't read past
                 * file_buf into adjacent BSS. */
                if (len < 0) len = 0;
                if ((size_t)len >= sizeof(file_buf)) len = sizeof(file_buf) - 1;

                /* Skip the FATFS rewrite AND NVS snapshot save when the
                 * rendered content matches the previous snapshot AND the
                 * file already exists on disk. The snapshot lives in NVS
                 * which survives a wiped/empty FATFS partition, so a
                 * snapshot match alone doesn't mean the file is there.
                 * Without the have_file guard a missing file would log
                 * the contradictory "no config.json ... will create" then
                 * "file matches snapshot, no rewrite needed" pair and
                 * leave the file still missing. Saves one FATFS-partition
                 * flash erase + one NVS write per boot on a stable device. */
                if (have_file && strcmp(file_buf, cfg_last_snapshot) == 0) {
                    fs_close(&cfg);
                    EARLY_LOG("Config: file matches snapshot (%d bytes), no rewrite needed", len);
                } else {
                    /* fs_write may return short on a full disk; truncate
                     * before write so the file size matches len exactly. */
                    fs_truncate(&cfg, 0);
                    fs_write(&cfg, file_buf, len);
                    fs_sync(&cfg);
                    fs_close(&cfg);
                    tinygs_config_save_snapshot(file_buf);
                    EARLY_LOG("Config: wrote config.json (%d bytes), snapshot updated", len);
                }
            }
        }

        /* Flush and unmount before USB MSC takes over */
        disk_access_ioctl("NAND", DISK_IOCTL_CTRL_SYNC, NULL);
        fs_unmount(&mp);
    }

    /* USB is already enabled in main() before this function is called */
}

/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* RadioLib — radio type selected by DTS compatible                             */
/* -------------------------------------------------------------------------- */

static ZephyrHal radio_hal(lora_spi.bus, (struct spi_config *)&lora_spi.config);
static Module *radio_mod = nullptr;
/* Radio type from DTS compatible — compile-time selection */
#define LORA_NODE DT_ALIAS(lora0)
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
  SX1262 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
  SX1268 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
  SX1276 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
  SX1278 *radio = nullptr;
#else
  #error "Unsupported LoRa radio — check lora0 alias in app.overlay"
#endif

/* LoRa packet reception flag — set by DIO1 ISR */
/* lora_packet_received moved to top — see forward declaration */

/* -------------------------------------------------------------------------- */
/* SNTP Time Sync                                                              */
/* -------------------------------------------------------------------------- */

