Bwooce/tinygs_nRF52/src/main.cpp
    if (err != OT_ERROR_NONE) {
        LOG_WRN("SNTP: query failed (%d %s)", (int)err, otThreadErrorToString(err));
        return;
    }

    /* Block the state machine until the callback fires or we hit the
     * timeout. Non-fatal on timeout: welcome still gets sent, just with
     * time=0. Server tolerates missing/zero time (it's an optional field). */
    if (k_sem_take(&sntp_sem, K_SECONDS(10)) != 0) {
        LOG_WRN("SNTP: response timeout, proceeding without synced time");
    }
}

/* Daily drift-correction. nRF52840 RC RTC is ~250 ppm = ~22 s/day, which
 * would visibly drift a stable connect over a few days. Runs on the system
 * workq so the 10 s blocking sntp_sync() doesn't stall the MQTT main loop.
 * Doesn't clear time_synced — old offset stays valid until the callback
 * atomically replaces it, so a failed periodic resync doesn't break the
 * station. Reschedules unconditionally: next attempt is always 24 h away. */
#define SNTP_RESYNC_INTERVAL  K_HOURS(24)
static void sntp_resync_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(sntp_resync_work, sntp_resync_work_handler);

static void sntp_resync_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);
    LOG_INF("SNTP: periodic drift-correction resync");
    sntp_sync();
    k_work_reschedule(&sntp_resync_work, SNTP_RESYNC_INTERVAL);
}

/* -------------------------------------------------------------------------- */
/* Doppler Compensation (P13 satellite propagator)                             */
/* -------------------------------------------------------------------------- */

#include "AioP13.h"

static uint32_t last_doppler_ms = 0;

/**
 * Compute Doppler shift using P13 propagator and apply to radio frequency.
 * Called every 4 seconds from the main loop. Requires valid TLE and time.
 *
 * NOTE: This requires real UTC time which we don't have (no NTP over Thread).
 * Doppler activates automatically when begine includes TLE data and
 * incorrect results without accurate time. When TLE data arrives and we
 * implement time sync, this will produce real Doppler corrections.
 */
static void doppler_update(void)
{
    if (!tinygs_radio.tle_valid || !radio) {
        return;
    }

    /* SNTP time sync via OpenThread SNTP client → Google NTP IPv6 */
    if (!time_synced) {
        return; /* No SNTP time yet — can't predict orbits */
    }

    int64_t epoch = get_utc_epoch();
    /* Convert epoch to Y/M/D H:M:S */
    /* Simple conversion — good enough for satellite tracking */
    time_t t = (time_t)epoch;
    struct tm *utc = gmtime(&t);
    if (!utc) return;

    P13DateTime dt(utc->tm_year + 1900, utc->tm_mon + 1, utc->tm_mday,
                   utc->tm_hour, utc->tm_min, utc->tm_sec);
    P13Observer obs("GS", (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt);
    P13Satellite_tGS sat(tinygs_radio.tle);

    sat.predict(dt);

    /* Get elevation and satellite map position */
    double elevation = 0.0, azimuth = 0.0;
    sat.elaz(obs, elevation, azimuth);

    /* Update satellite position for world map display (128x64 ESP32 coords).
     * Guard against malformed orbital elements (rare, e.g. server sends a
     * tlx with mean motion = 0 → propagator chain produces NaN). NaN would
     * propagate into sat_pos_{x,y}, then `(int)(NaN * ...)` is implementation-
     * defined and the worldmap red dot silently fails to draw. Skip the
     * update on bad math so the last good position stays on screen. */
    double sat_lat = 0, sat_lon = 0;
    sat.latlon(sat_lat, sat_lon);
    /* Range check doubles as a NaN/Inf guard — both compare false to any
     * bounded value, so the bad-lat/lon branch catches them. */
    if (sat_lat >= -90.0 && sat_lat <= 90.0 &&
        sat_lon >= -180.0 && sat_lon <= 180.0) {
        k_mutex_lock(&tinygs_radio_mutex, K_FOREVER);
        tinygs_radio.sat_pos_x = (float)((180.0 + sat_lon) / 360.0 * 128.0);
        tinygs_radio.sat_pos_y = (float)((90.0 - sat_lat) / 180.0 * 64.0);
        tinygs_radio.sat_lat = (float)sat_lat;
        tinygs_radio.sat_lon = (float)sat_lon;
        tinygs_radio.sat_azimuth = (float)azimuth;
        tinygs_radio.sat_elevation = (float)elevation;
        k_mutex_unlock(&tinygs_radio_mutex);
        /* Suppress sub-pixel updates — the display only redraws on
         * integer-pixel transitions, so anything finer is log noise.
         * 240×135 display, 128×64 grid → ~1.875 px-per-grid-x,
         * ~2.1 px-per-grid-y. Compare integer-display-pixel coords. */
        static int last_disp_x = -1, last_disp_y = -1;
        int disp_x = (int)(tinygs_radio.sat_pos_x * 240 / 128);
        int disp_y = (int)(tinygs_radio.sat_pos_y * 135 / 64);
        if (disp_x != last_disp_x || disp_y != last_disp_y) {
            LOG_INF("Sat %s @ lat=%.2f lon=%.2f el=%.1f° → pixel (%d,%d)",
                    tinygs_radio.satellite, sat_lat, sat_lon, elevation,
                    disp_x, disp_y);
            last_disp_x = disp_x;
            last_disp_y = disp_y;
        }
    } else {
        LOG_WRN("Sat %s: propagator returned bad lat/lon (%.2f, %.2f) — keeping last",
                tinygs_radio.satellite, sat_lat, sat_lon);
    }

    if (elevation <= 0.0 || !tinygs_radio.doppler_enabled) {
        return; /* Below horizon or Doppler disabled (tlx) — position updated, no freq correction */
    }

    /* Compute Doppler — doppler() takes MHz, returns shifted MHz */
    double rx_freq_mhz = (double)tinygs_radio.frequency;
    double doppler_freq_mhz = sat.doppler(rx_freq_mhz, P13_FRX);
    float new_doppler = (float)((doppler_freq_mhz - rx_freq_mhz) * 1e6);

    /* Hysteresis — only retune if change exceeds tolerance */
    if (fabsf(new_doppler - tinygs_radio.freq_doppler) > tinygs_radio.doppler_tol) {
        /* Don't retune mid-packet. setFrequency() puts the SX1262 through
         * standby, which aborts any in-progress reception — and slow
         * configs (SF11/12 LoRa, low-bitrate FSK) take longer than the
         * 4 s doppler interval to receive a single packet. If the radio
         * has detected a preamble, sync word, or LoRa header, skip this
         * tick and try again in 4 s. The deferred shift is well under
         * the 1200 Hz hysteresis (typical accumulation is ~50–100 Hz/4 s
         * at LEO Doppler rates), so we're not losing meaningful tracking
         * accuracy by waiting one cycle. */
        uint32_t irq = radio->getIrqFlags();
        if (irq & (RADIOLIB_SX126X_IRQ_PREAMBLE_DETECTED |
                   RADIOLIB_SX126X_IRQ_SYNC_WORD_VALID |
                   RADIOLIB_SX126X_IRQ_HEADER_VALID)) {
            return;
        }

        k_mutex_lock(&tinygs_radio_mutex, K_FOREVER);
        tinygs_radio.freq_doppler = new_doppler;
        float effective_freq = tinygs_radio.frequency +
                              (tinygs_radio.freq_offset + tinygs_radio.freq_doppler) / 1e6f;
        k_mutex_unlock(&tinygs_radio_mutex);
        radio->setFrequency(effective_freq);
        radio->startReceive();
        LOG_INF("Doppler: %.0f Hz → %.6f MHz (el=%.1f°)",
                (double)new_doppler, (double)effective_freq, elevation);
    }
}

