Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* LoRa RX                                                                     */
/* -------------------------------------------------------------------------- */

static void lora_rx_callback(void)
{
    lora_packet_received = true;
}

static void init_radio(void)
{
    LOG_INF("Initializing LoRa radio (%s)...", DT_NODE_FULL_NAME(LORA_NODE));

    uint32_t cs   = radio_hal.addPin(&lora_cs);
    uint32_t rst  = radio_hal.addPin(&lora_reset);
    uint32_t busy = radio_hal.addPin(&lora_busy);
    uint32_t dio1 = radio_hal.addPin(&lora_dio1);

    /* Run HAL smoke tests before radio init */
    /* HAL smoke tests disabled for production — saves ~1KB flash
     * extern int zephyr_hal_run_tests(ZephyrHal *hal);
     * zephyr_hal_run_tests(&radio_hal); */

    radio_mod = new Module(&radio_hal, cs, dio1, rst, busy);
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
    radio = new SX1262(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
    radio = new SX1268(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
    radio = new SX1276(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
    radio = new SX1278(radio_mod);
#endif

    /* TCXO voltage is derived from the DTS (`dio3-tcxo-voltage` property on
     * the SX1262 node). LORA_TCXO_VOLTAGE resolves to 1.8f on the T114 and
     * to 0.0f on boards without a TCXO — passing 0.0f tells RadioLib there
     * is no TCXO and skips the startup sequence. Must not hardcode 1.8f
     * here; doing so would freeze a no-TCXO board during begin(). */
    int state = radio->begin(TINYGS_DEFAULT_FREQ, 250.0, 10, 5, 0x12, 5, 8,
                             LORA_TCXO_VOLTAGE);
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("Radio: %s initialized (RadioLib)",
                DT_NODE_FULL_NAME(DT_NODELABEL(sx1262)));
    } else {
        LOG_ERR("Radio init failed: %d (%s)", state, radio_err_name(state));
        return;
    }

    /* begin() already set default params, just add boosted gain */
    radio->autoLDRO();
    radio->setRxBoostedGainMode(true);

    /* Register DIO1 interrupt callback and start receiving */
    radio->setPacketReceivedAction(lora_rx_callback);
    state = radio->startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("LoRa listening on %.3f MHz, SF%d, BW%.0f",
                (double)tinygs_radio.frequency, tinygs_radio.sf,
                (double)tinygs_radio.bw);
    } else {
        LOG_ERR("startReceive failed: %d (%s)", state, radio_err_name(state));
    }
}

/*
 * Apply the modem config persisted by the last beginp. Called after
 * init_radio() — overrides the hardcoded defaults when NVS has a saved
 * blob. Subset of the full begine handler: applies the core radio
 * settings (mode/freq/bw/sf/cr/sw/pl/iIQ for LoRa; freq/br/fd/bw/pl/sync
 * for FSK). The server will send a fresh `begine` on next connect which
 * will fully reconfigure including filter + TLE, so we don't duplicate
 * that logic here.
 */
static void apply_saved_modem_conf(void)
{
    if (!radio) return;
    char *conf = tinygs_radio.modem_conf;
    if (!conf || conf[0] == '\0' || strcmp(conf, "{}") == 0) {
        LOG_INF("No saved modem_conf — using defaults");
        return;
    }

    /* tinygs_parse_begine modifies the buffer in place (strtok-style) — we
     * only want to inspect what we saved, not mangle it. Parse a copy. */
    static char scratch[sizeof(tinygs_radio.modem_conf)];
    size_t n = strlen(conf);
    memcpy(scratch, conf, n + 1);

    struct tinygs_begine_msg msg;
    int64_t rc = tinygs_parse_begine(scratch, n, &msg);
    if (rc < 0 || !msg.mode) {
        LOG_WRN("Saved modem_conf unparsable — using defaults");
        return;
    }

    bool is_fsk = (strcmp(msg.mode, "FSK") == 0);
    float freq = tinygs_begine_get_freq(&msg);
    float bw   = tinygs_begine_get_bw(&msg);
    if (is_fsk) {
        float br = tinygs_begine_get_br(&msg);
        float fd = tinygs_begine_get_fd(&msg);
        int16_t src = radio->beginFSK(freq, br, fd, bw,
                                      msg.pwr, msg.pl, 1.8f);
        if (src == RADIOLIB_ERR_NONE) {
            tinygs_radio.frequency   = freq;
            tinygs_radio.bw          = bw;
            tinygs_radio.bitrate     = br;
            tinygs_radio.freq_dev    = fd;
            strncpy(tinygs_radio.modem_mode, "FSK",
                    sizeof(tinygs_radio.modem_mode));
            LOG_INF("Applied saved modem_conf: FSK %.4f MHz br=%.3f fd=%.3f bw=%.1f",
                    (double)freq, (double)br, (double)fd, (double)bw);
        } else {
            LOG_WRN("Saved FSK config rejected (%d), using defaults", src);
        }
    } else {
        int16_t src = radio->begin(freq, bw, msg.sf, msg.cr,
                                   msg.sw, msg.pwr, msg.pl, 1.8f);
        if (src == RADIOLIB_ERR_NONE) {
            radio->invertIQ(msg.iIQ);
            tinygs_radio.frequency = freq;
            tinygs_radio.bw        = bw;
            tinygs_radio.sf        = msg.sf;
            tinygs_radio.cr        = msg.cr;
            tinygs_radio.iIQ       = msg.iIQ;
            strncpy(tinygs_radio.modem_mode, "LoRa",
                    sizeof(tinygs_radio.modem_mode));
            LOG_INF("Applied saved modem_conf: LoRa %.4f MHz SF%d CR%d BW%.1f",
                    (double)freq, msg.sf, msg.cr, (double)bw);
        } else {
            LOG_WRN("Saved LoRa config rejected (%d), using defaults", src);
        }
    }
    /* Satellite name + NORAD for welcome/status continuity */
    if (msg.sat) {
        strncpy(tinygs_radio.satellite, msg.sat,
                sizeof(tinygs_radio.satellite) - 1);
        tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
    }
    tinygs_radio.norad = (uint32_t)msg.NORAD;
    radio->startReceive();
}

/*
 * Check for received LoRa packets and process them.
 * Called from the main loop. Returns true if a packet was processed.
 */
static bool lora_check_rx(void)
{
    if (!lora_packet_received || radio == nullptr) {
        return false;
    }

    lora_packet_received = false;

    size_t len = radio->getPacketLength();
    if (len == 0 || len > 255) {
        radio->startReceive();
        return false;
    }

