Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Main                                                                        */
/* -------------------------------------------------------------------------- */

int main(void)
{
    const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
    uint32_t dtr = 0;

    k_work_init(&reset_work, reset_work_handler);

    if (device_is_ready(console_dev)) {
        cdc_acm_dte_rate_callback_set(console_dev, baudrate_reset_handler);
    }

    enable_peripherals();

    /* NVS (settings) BEFORE FATFS so the runtime variables hold the
     * authoritative server-side state when setup_usb_storage() reads
     * config.json. settings_subsys_init() is idempotent and only needs
     * the flash driver, which Zephyr SYS_INITs before main() runs.
     * Without this ordering: USB writes config.json from compiled
     * defaults (NVS not yet loaded), then NVS load overwrites memory
     * — config.json on the drive ends up stuck at defaults forever
     * even after server-driven NVS updates. */
    tinygs_config_init();

    /* FATFS operations BEFORE USB enable — mount, write, read, unmount.
     * Must complete before USB MSC goes live to avoid concurrent access. */
    setup_usb_storage();

    /* Enable USB composite (CDC ACM console + MSC drive) only if a cable
     * is plugged in. The usb_vbus_work delayable on the system workqueue
     * (scheduled below) handles hot-plug later, regardless of which
     * connection state the main loop is parked in. Skipping usb_enable()
     * on battery saves ~1 mA. */
    last_vbus_state = usb_vbus_present();
    vbus_change_ms = k_uptime_get_32();
    if (last_vbus_state) {
        if (usb_enable(NULL) == 0) {
            usb_is_enabled = true;
            EARLY_LOG("USB active (MSC + CDC ACM)");
        }
    } else {
        EARLY_LOG("USB cable absent at boot — stack stays disabled");
    }

    /* Wait briefly for serial monitor to connect — only if USB is up.
     * Without this guard the DTR poll wastes 3 s on battery boots. */
    if (usb_is_enabled) {
        for (int i = 0; i < 150 && !dtr; i++) {
            uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr);
            k_msleep(100);
        }
    }

    /* Start the VBUS poll on the system workqueue. Runs every 250 ms
     * regardless of state-machine position so hot-plug works even when
     * the device is stuck in STATE_WAIT_THREAD or STATE_ERROR. */
    k_work_schedule(&usb_vbus_work, K_MSEC(USB_VBUS_POLL_MS));

    /* Replay buffered early-boot logs now that the host has the port open
     * (or boot timed out). See early_log_appendf() for why this exists. */
    early_log_dump();

    LOG_INF("=== TinyGS nRF52 v%u — Thread/MQTT-TLS ===", (unsigned)TINYGS_VERSION);

    /* Log boot/reset reason — read raw nRF RESETREAS for full picture.
     * Errata 136: after pin reset, other bits may be falsely set. */
    {
        uint32_t resetreas = NRF_POWER->RESETREAS;
        NRF_POWER->RESETREAS = resetreas; /* Clear by writing 1s */
        uint32_t gpregret = nrf_power_gpregret_get(NRF_POWER, 0);

        LOG_INF("Boot: RESETREAS=0x%08x gpregret=0x%02x [%s%s%s%s%s%s]",
                resetreas, gpregret,
                (resetreas & (1<<0)) ? "PIN " : "",
                (resetreas & (1<<1)) ? "DOG " : "",
                (resetreas & (1<<2)) ? "SREQ " : "",
                (resetreas & (1<<3)) ? "LOCKUP " : "",
                (resetreas & (1<<16)) ? "OFF " : "",
                (resetreas & (1<<17)) ? "DIF " : "");

        if (gpregret == 0x57) {
            LOG_INF("  → 1200-baud bootloader entry");
        }
        if (resetreas & (1<<3)) {
            LOG_ERR("  → CPU LOCKUP detected! (fault-in-fault-handler)");
        }
    }

    /* Check for crash diagnostic from previous boot (retained RAM) */
    if ((crash_reason & 0xFFFF0000) == CRASH_MAGIC) {
        uint32_t vectactive = crash_icsr & 0x1FF;
        int irq_num = (int)vectactive - 16;
        unsigned r = crash_reason & 0xFFFF;
        static const char *reason_names[] = {
            "CPU_EXCEPTION", "SPURIOUS_IRQ", "STACK_CHK_FAIL",
            "KERNEL_OOPS",   "KERNEL_PANIC"
        };
        const char *reason_str = (r < ARRAY_SIZE(reason_names)) ? reason_names[r] : "ARCH_SPECIFIC";
        /* nRF52840 external IRQ number → peripheral name */
        static const char *irq_names[] = {
            "POWER_CLOCK","RADIO","UARTE0","SPI0","SPI1","NFCT","GPIOTE","SAADC",
            "TIMER0","TIMER1","TIMER2","RTC0","TEMP","RNG","ECB","CCM_AAR",
            "WDT","RTC1","QDEC","COMP","SWI0","SWI1","SWI2","SWI3","SWI4","SWI5",
            "TIMER3","TIMER4","PWM0","PDM","res30","res31","MWU","PWM1","PWM2",
            "SPI2","RTC2","I2S","FPU","USBD","UARTE1","QSPI","CRYPTOCELL"
        };
        const char *irq_str = (irq_num >= 0 && irq_num < (int)ARRAY_SIZE(irq_names))
                               ? irq_names[irq_num] : "?";
        LOG_ERR("*** PREVIOUS CRASH: thread='%s'(%p) reason=%u(%s) PC=0x%08x LR=0x%08x ICSR=0x%08x IRQ=%d(%s) ***",
                crash_thread[0] ? crash_thread : "?",
                (void *)(uintptr_t)crash_thread_ptr,
                r, reason_str,
                (unsigned)crash_pc, (unsigned)crash_lr,
                (unsigned)crash_icsr, irq_num, irq_str);
        /* Decode CFSR — the bit that's set tells us the exact fault subtype.
         * UFSR.INVPC (bit 18) means the saved return address was garbage
         * (smashed stack); UFSR.UNALIGNED (bit 24) means a real instruction
         * at PC did an unaligned access. Very different bugs. */
        {
            uint32_t cfsr = crash_cfsr;
            uint32_t ufsr = (cfsr >> 16) & 0xFFFF;
            uint32_t bfsr = (cfsr >> 8)  & 0xFF;
            uint32_t mmfsr = cfsr & 0xFF;
            LOG_ERR("  CFSR=0x%08x  UFSR=0x%04x [%s%s%s%s%s%s] BFSR=0x%02x MMFSR=0x%02x HFSR=0x%08x",
                    (unsigned)cfsr, (unsigned)ufsr,
                    (ufsr & (1u<<0))  ? "UNDEFINSTR " : "",
                    (ufsr & (1u<<1))  ? "INVSTATE "   : "",
                    (ufsr & (1u<<2))  ? "INVPC "      : "",
                    (ufsr & (1u<<3))  ? "NOCP "       : "",
                    (ufsr & (1u<<8))  ? "UNALIGNED "  : "",
                    (ufsr & (1u<<9))  ? "DIVBYZERO "  : "",
                    (unsigned)bfsr, (unsigned)mmfsr,
                    (unsigned)crash_hfsr);
            LOG_ERR("  MMFAR=0x%08x BFAR=0x%08x", (unsigned)crash_mmfar, (unsigned)crash_bfar);
        }
        LOG_ERR("  R0=0x%08x R1=0x%08x R2=0x%08x R3=0x%08x R12=0x%08x xPSR=0x%08x",
                (unsigned)crash_r0, (unsigned)crash_r1, (unsigned)crash_r2,
                (unsigned)crash_r3, (unsigned)crash_r12, (unsigned)crash_xpsr);
#if defined(CONFIG_EXTRA_EXCEPTION_INFO)
        /* Callee-saved r4-r11 survive PSP corruption (Zephyr pushes them
         * separately on its own kernel-mode stack). One or more of these is
         * usually a real flash address pointing INTO the function whose
         * stack got smashed — the actual culprit. addr2line every one. */
        LOG_ERR("  R4=0x%08x R5=0x%08x R6=0x%08x R7=0x%08x",
                (unsigned)crash_r4, (unsigned)crash_r5,
                (unsigned)crash_r6, (unsigned)crash_r7);
        LOG_ERR("  R8=0x%08x R9=0x%08x R10=0x%08x R11=0x%08x",
                (unsigned)crash_r8, (unsigned)crash_r9,
                (unsigned)crash_r10, (unsigned)crash_r11);
        LOG_ERR("  MSP=0x%08x EXC_RETURN=0x%08x", (unsigned)crash_msp, (unsigned)crash_exc_return);
#endif
        LOG_ERR("  stack@0x%08x: %08x %08x %08x %08x %08x %08x %08x %08x",
                (unsigned)crash_sp,
                (unsigned)crash_stack[0], (unsigned)crash_stack[1],
                (unsigned)crash_stack[2], (unsigned)crash_stack[3],
                (unsigned)crash_stack[4], (unsigned)crash_stack[5],
                (unsigned)crash_stack[6], (unsigned)crash_stack[7]);
        LOG_ERR("Use: arm-zephyr-eabi-addr2line -e build/zephyr/zephyr.elf 0x%08x  (and PC/LR/stack words above)",
                (unsigned)crash_pc);
        crash_reason = 0; /* Clear so we don't report again */
    } else if ((crash_reason & 0xFFFF0000) == WDT_CRASH_MAGIC) {
        /* Watchdog pre-fire snapshot. "Running at pre-fire" is the thread
         * the WDT IRQ preempted; PC/LR are the saved values from its
         * exception frame on PSP. main_alive_uptime_ms + main_phase narrow
         * the diagnosis to which step inside main was active when the
         * loop last ran. (No VECTACTIVE: it always reads as the WDT IRQ
         * itself from inside this handler.) */
        LOG_ERR("*** PREVIOUS WATCHDOG RESET ***");
        LOG_ERR("  preempted thread: '%s' (%p) PC=0x%08x LR=0x%08x",
                crash_thread[0] ? crash_thread : "?",
                (void *)(uintptr_t)crash_thread_ptr,
                (unsigned)crash_pc, (unsigned)crash_lr);
        LOG_ERR("  last wdt_feed: thread='%s' (%p) at uptime=%u ms",
                wdt_last_feeder_name[0] ? wdt_last_feeder_name : "?",
                (void *)(uintptr_t)wdt_last_feeder_thread_ptr,
                (unsigned)wdt_last_feed_uptime_ms);
        LOG_ERR("  main loop: phase=%u(%s) last_alive_uptime=%u ms",
                main_phase, main_phase_name(main_phase),
                (unsigned)main_alive_uptime_ms);
        if (crash_pc) {
            LOG_ERR("  Use: arm-zephyr-eabi-addr2line -e build/zephyr/zephyr.elf 0x%08x",
                    (unsigned)crash_pc);
        }
        crash_reason = 0;
    } else if ((crash_reason & 0xFFFF0000) == MQTT_SILENCE_MAGIC) {
        /* Soft reboot triggered by main when MQTT went silent past the
         * timeout. Caught a network/Thread-stack wedge that the hardware
         * WDT couldn't see (because main was happily looping and feeding
         * it). The recorded last_activity_ms is from the *previous* boot's
         * uptime — the gap between that and reboot was at least the
         * configured timeout. */
        LOG_ERR("*** PREVIOUS MQTT-SILENCE REBOOT ***");
        LOG_ERR("  last MQTT activity at uptime=%u ms (pre-boot timeline)",
                (unsigned)mqtt_silence_uptime_ms);
        LOG_ERR("  threshold=%u ms — main loop and WDT were healthy; broker round-trip wasn't",
                (unsigned)MQTT_SILENCE_TIMEOUT_MS);
        crash_reason = 0;
    }

