Bwooce/tinygs_nRF52/src/main.cpp
    log_heap_usage("boot");
    epoch_persist_restore();
    init_openthread();

#if defined(CONFIG_IOT_LOG)
    {
        iot_log_config_t log_cfg = IOT_LOG_CONFIG_DEFAULT();
        log_cfg.device_name = "TinyGS-nRF52";
        log_cfg.level = IOT_LOG_DEBUG;
        log_cfg.always_on = false;
        iot_log_init(&log_cfg);
    }
#endif

    /* Check if device has Thread credentials (commissioned).
     * If not, stay fully awake for 15 minutes to allow Joiner commissioning.
     * The user needs time to scan the QR code from index.html. */
    {
        struct openthread_context *ot_ctx = openthread_get_default_context();
        if (ot_ctx) {
            openthread_api_mutex_lock(ot_ctx);
            bool commissioned = otDatasetIsCommissioned(openthread_get_default_instance());
            openthread_api_mutex_unlock(ot_ctx);

            if (!commissioned) {
                LOG_INF("*** COMMISSIONING MODE ***");
                LOG_INF("Device not provisioned — staying awake for 15 minutes");
                LOG_INF("Joiner PSKd: %s", TINYGS_JOINER_PSKD);
                LOG_INF("Scan QR code from index.html or run:");
                LOG_INF("  ot-ctl commissioner joiner add '*' %s",
                        TINYGS_JOINER_PSKD);
                /* Keep display on during commissioning */
                tinygs_display_set_timeout(900); /* 15 minutes */
            } else {
                LOG_INF("Thread credentials found — normal mode");
            }
        }
    }

    /* tinygs_config_init() was called earlier (before setup_usb_storage)
     * so config.json sync uses authoritative NVS state. Don't double-init. */
    tinygs_display_init();
    watchdog_init();
    ext_flash_probe();
    led_init();
    breathing_led_init();
    init_radio();
    apply_saved_modem_conf();

    /* Initialize liveness markers and start the WDT feeder work BEFORE the
     * state machine starts. main_alive_uptime_ms must be fresh so the very
     * first feeder tick (60 s in) finds main alive. mqtt_last_activity_ms
     * gets a one-window grace so the silence reboot can't fire before we've
     * had a chance to connect. */
    main_alive_uptime_ms = k_uptime_get_32();
    mqtt_last_activity_ms = main_alive_uptime_ms;
    k_work_reschedule(&wdt_feeder_work, K_MSEC(WDT_FEED_INTERVAL_MS));

    int retry_count = 0;
    int mqtt_poll_fd_count = 0;
    struct zsock_pollfd mqtt_poll_fd;

    while (1) {
        /* Outer-loop liveness — bumped every state iteration so the WDT
         * feeder workqueue can prove main isn't wedged regardless of which
         * state we're in. */
        main_alive_uptime_ms = k_uptime_get_32();

        /* Pause the silence timer while Thread isn't attached. With no L3
         * path, MQTT can't possibly have activity, so the catastrophe-reboot
         * would just wipe out long-running joiner retries (commissioning may
         * take many minutes if steering data propagation is intermittent). */
        if (!thread_attached) {
            mqtt_last_activity_ms = main_alive_uptime_ms;
        }

        /* Catastrophic-only fallback: if MQTT inbound traffic stops for too
         * long in ANY state (including a never-reached-CONNECTED boot loop),
         * sys_reboot. The unacked-ping reconnect path inside CONNECTED
         * normally catches broker silence in ~120 s; this 10-min check is
         * the last resort for cases where reconnect itself can't make
         * progress (NAT64 broken, broker down, mutex deadlock in TX). */
        if ((main_alive_uptime_ms - mqtt_last_activity_ms) > MQTT_SILENCE_TIMEOUT_MS) {
            crash_reason = MQTT_SILENCE_MAGIC;
            mqtt_silence_uptime_ms = mqtt_last_activity_ms;
            LOG_ERR("MQTT silent for %u ms (state=%d) — forcing reboot (last resort)",
                    (unsigned)(main_alive_uptime_ms - mqtt_last_activity_ms),
                    (int)app_state);
            k_msleep(100);  /* let LOG_ERR flush before reset */
            sys_reboot(SYS_REBOOT_COLD);
        }

        switch (app_state) {

        case STATE_WAIT_THREAD:
            /* Blue blink while waiting for Thread */
            neopixel_set(0, 0, (k_uptime_get_32() / 500) % 2 ? 20 : 0,  NEO_OFF); /* Blue blink = waiting for Thread */
            if (thread_attached) {
                /* Heap stats now in periodic STATUS log */
                LOG_INF("--- Thread attached, waiting 5s for routing to stabilize ---");
                k_msleep(5000);
                /* iot_log self-drives via its own workqueue (every 1s),
                 * so deferred multicast join + drain run regardless of
                 * which app state we are in. */
                app_state = STATE_DNS_RESOLVE;
                retry_count = 0;
            } else {
                LOG_INF("Waiting for Thread network... (%ds)", retry_count * 10);
                log_ot_diagnostics();
                retry_count++;
                k_msleep(10000);
            }
            break;

        case STATE_DNS_RESOLVE:
            /* Heap stats now in periodic STATUS log */
            log_ot_diagnostics();
            if (resolve_broker() == 0) {
                /* Sync time before MQTT connect so the welcome payload
                 * carries a valid `time` field. Non-fatal: if SNTP fails
                 * we connect anyway and welcome uses whatever time we
                 * have (possibly the __noinit-restored stale value).
                 * MQTT reconnects within the same boot reuse the cached
                 * offset (sntp_done_this_boot=true). */
                if (!sntp_done_this_boot) {
                    sntp_sync();
                    /* Kick off periodic drift-correction regardless of
                     * boot-sync success — if boot failed, tomorrow's
                     * attempt might succeed. */
                    k_work_reschedule(&sntp_resync_work, SNTP_RESYNC_INTERVAL);
                }
                app_state = STATE_MQTT_CONNECT;
            } else {
                retry_count++;
                if (retry_count > 10) {
                    LOG_ERR("DNS failed after %d attempts", retry_count);
                    app_state = STATE_ERROR;
                } else {
                    LOG_WRN("DNS retry %d/10 in 5s...", retry_count);
                    k_msleep(5000);
                }
            }
            break;

        case STATE_MQTT_CONNECT:
            /* Heap stats now in periodic STATUS log */
            if (mqtt_tls_connect() == 0) {
                /* Set up poll fd for mqtt_input */
                mqtt_poll_fd.fd = mqtt_client.transport.tls.sock;
                mqtt_poll_fd.events = ZSOCK_POLLIN;
                mqtt_poll_fd_count = 1;

                /* Process until CONNACK or timeout */
                int wait_ms = 15000; /* 15s for TLS handshake + CONNACK */
                while (app_state == STATE_MQTT_CONNECT && wait_ms > 0) {
                    int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 1000);
                    if (rc > 0) {
                        int in_rc = mqtt_input(&mqtt_client);
                        if (in_rc < 0) {
                            LOG_ERR("mqtt_input failed during connect: %d", in_rc);
                            mqtt_disconnect(&mqtt_client, NULL);
                            app_state = STATE_ERROR;
                            break;
                        }
                    } else if (rc < 0) {
                        LOG_ERR("zsock_poll failed during connect: %d", rc);
                        mqtt_disconnect(&mqtt_client, NULL);
                        app_state = STATE_ERROR;
                        break;
                    }
                    mqtt_live(&mqtt_client);
                    wait_ms -= 1000;
                }
                if (app_state == STATE_MQTT_CONNECT) {
                    LOG_ERR("MQTT connect timeout (no CONNACK in 15s)");
                    mqtt_disconnect(&mqtt_client, NULL);
                    app_state = STATE_ERROR;
                }
            } else {
                app_state = STATE_ERROR;
            }
            break;

