Bwooce/tinygs_nRF52/src/main.cpp
        case STATE_MQTT_CONNECTED: {
            LOG_INF("MQTT connected, entering main loop");
            neopixel_off(); /* NeoPixels off when stable */
            breathing_led_start(); /* Green LED breathes when connected */

            /* Bring up the device web UI on :80 once Thread+MQTT are up.
             * web_ui_start is idempotent so reconnect cycles don't double-init. */
            (void)web_ui_start();

            /* Time sync happens pre-connect so welcome carries a valid
             * `time` field (see STATE_DNS_RESOLVE). */

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();
            uint32_t last_status_log_ms = last_ping_ms;
            uint32_t last_force_ping_ms = last_ping_ms;
            #define STATUS_LOG_INTERVAL_MS 300000 /* 5 minutes */

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Liveness bump moved to top of outer loop so it covers all
                 * states. WDT feed now happens on the system workqueue gated
                 * on main_alive_uptime_ms freshness. MQTT silence reboot
                 * also moved to outer loop top so it fires from any state. */
                main_alive_uptime_ms = k_uptime_get_32();

                main_phase = MAIN_PHASE_POLL;
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    int in_rc = mqtt_input(&mqtt_client);
                    if (in_rc < 0) {
                        LOG_ERR("mqtt_input failed: %d", in_rc);
                        mqtt_disconnect(&mqtt_client, NULL);
                        app_state = STATE_MQTT_CONNECT;
                        break;
                    }
                } else if (rc < 0) {
                    LOG_ERR("zsock_poll failed: %d", rc);
                    mqtt_disconnect(&mqtt_client, NULL);
                    app_state = STATE_MQTT_CONNECT;
                    break;
                }
                
                main_phase = MAIN_PHASE_MQTT_LIVE;
                {
                    int live_ret = mqtt_live(&mqtt_client);
                    if (live_ret != 0 && live_ret != -EAGAIN) {
                        LOG_ERR("mqtt_live error: %d (%s)", live_ret, errno_name(live_ret));
                        mqtt_disconnect(&mqtt_client, NULL);
                        app_state = STATE_MQTT_CONNECT;
                        break;
                    }
                }

                    /* Active broker liveness probe. Zephyr's mqtt_live() only
                     * issues PINGREQ when its own internal.last_activity is
                     * stale, but our 60 s TinyGS publishes keep that fresh
                     * forever — so unacked_ping never climbs and the
                     * existing reconnect-on-unacked check below never fires.
                     * Force PINGREQ at a fixed cadence so unacked_ping
                     * actually reflects broker responsiveness:
                     *   - alive broker: PINGRESP arrives, unacked decrements
                     *   - silent broker: 2 PINGREQs → unacked = 2 → reconnect
                     *
                     * mqtt_ping() is non-blocking and just queues the request. */
                    if ((main_alive_uptime_ms - last_force_ping_ms) >= MQTT_FORCE_PING_INTERVAL_MS) {
                        if (mqtt_ping(&mqtt_client) == 0) {
                            last_force_ping_ms = main_alive_uptime_ms;
                        }
                    }

                    /* Existing unacked-ping reconnect — primary recovery path
                     * now that PINGREQs are actively driven above. */
                    if (mqtt_client.unacked_ping >= TINYGS_MQTT_UNACKED_PING_MAX) {
                        LOG_WRN("MQTT: %d unacked PINGREQs — forcing reconnect",
                                mqtt_client.unacked_ping);
                        mqtt_disconnect(&mqtt_client, NULL);
                        app_state = STATE_MQTT_CONNECT;
                        break;
                    }

                main_phase = MAIN_PHASE_LORA_RX;
                lora_check_rx();

                main_phase = MAIN_PHASE_DISPLAY;
                tinygs_display_update();

                /* iot_log self-drives via its own workqueue. */

                main_phase = MAIN_PHASE_DOPPLER;
                uint32_t now_ms = k_uptime_get_32();
                if ((now_ms - last_doppler_ms) >= doppler_interval_ms) {
                    doppler_update();
                    last_doppler_ms = now_ms;
                }

                main_phase = MAIN_PHASE_PING;
                if ((now_ms - last_ping_ms) >= (TINYGS_PING_INTERVAL_S * 1000)) {
                    tinygs_send_ping(&mqtt_client, cfg_mqtt_user, cfg_station);
                    last_ping_ms = now_ms;
                }

                main_phase = MAIN_PHASE_WEBLOGIN;
                if (tinygs_display_weblogin_requested()) {
                    tinygs_send_weblogin_request(&mqtt_client, cfg_mqtt_user, cfg_station);
                }

                /* Web UI /cs commands (Phase 4). The handlers run on the
                 * HTTP server thread but must not touch the radio or
                 * sys_reboot from there — they latch flags here. */
                {
                    if (web_ui_pop_reboot_request()) {
                        LOG_WRN("Web UI reboot — sleeping 1s then sys_reboot");
                        k_msleep(1000);
                        sys_reboot(SYS_REBOOT_COLD);
                    }
                    if (web_ui_pop_test_packet_request() && radio && cfg_tx_enable) {
                        const uint8_t test_pkt[] = "TINYGS-TEST";
                        int rc = radio->transmit((uint8_t *)test_pkt,
                                                 sizeof(test_pkt) - 1);
                        LOG_INF("Web UI test TX: rc=%d", rc);
                        radio->startReceive();
                    }
                }

                /* Track main thread stack high-water mark */
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                {
                    static size_t stack_hwm = SIZE_MAX;
                    size_t unused = 0;
                    if (k_thread_stack_space_get(k_current_get(), &unused) == 0) {
                        if (unused < stack_hwm) stack_hwm = unused;
                    }
                }
#endif

