Bwooce/tinygs_nRF52/src/main.cpp
                main_phase = MAIN_PHASE_STATUS;
                if ((now_ms - last_status_log_ms) >= STATUS_LOG_INTERVAL_MS) {
                    uint32_t uptime_s = k_uptime_get_32() / 1000;
                    uint32_t conn_s = (now_ms - mqtt_connected_uptime_ms) / 1000;

                    /* Get main thread stack usage */
                    size_t stack_unused = 0;
                    size_t stack_size = CONFIG_MAIN_STACK_SIZE;
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                    k_thread_stack_space_get(k_current_get(), &stack_unused);
#endif
                    size_t stack_used = stack_size - stack_unused;

                    /* HTTP server thread (defined in http_server_core.c via
                     * K_THREAD_DEFINE) — separate stack we want to track now
                     * that the web UI is exercising it. */
                    size_t http_stack_used = 0;
                    size_t http_stack_size = CONFIG_HTTP_SERVER_STACK_SIZE;
#if defined(CONFIG_HTTP_SERVER) && defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                    {
                        extern const k_tid_t http_server_tid;
                        size_t http_stack_unused = 0;
                        if (http_server_tid && k_thread_stack_space_get(http_server_tid,
                                                       &http_stack_unused) == 0) {
                            http_stack_used = http_stack_size - http_stack_unused;
                        }
                    }
#endif

                    /* net_buf RX/TX data-pool peaks. Tracked since boot via
                     * CONFIG_NET_BUF_POOL_USAGE=y. The 117-byte allocation
                     * failures on every boot's MQTT-publish ramp live here —
                     * a `peak == buf_count` says we hit the wall, ` <` says
                     * we have headroom. */
                    uint16_t nb_rx_peak = 0, nb_rx_total = 0;
                    uint16_t nb_tx_peak = 0, nb_tx_total = 0;
                    uint32_t pkt_rx_peak = 0, pkt_rx_total = 0;
                    uint32_t pkt_tx_peak = 0, pkt_tx_total = 0;
#if defined(CONFIG_NET_BUF_POOL_USAGE)
                    {
                        struct k_mem_slab *pkt_rx, *pkt_tx;
                        struct net_buf_pool *buf_rx, *buf_tx;
                        net_pkt_get_info(&pkt_rx, &pkt_tx, &buf_rx, &buf_tx);
                        if (buf_rx) { nb_rx_peak = buf_rx->max_used; nb_rx_total = buf_rx->buf_count; }
                        if (buf_tx) { nb_tx_peak = buf_tx->max_used; nb_tx_total = buf_tx->buf_count; }
                        if (pkt_rx) { pkt_rx_peak = k_mem_slab_max_used_get(pkt_rx); pkt_rx_total = pkt_rx->info.num_blocks; }
                        if (pkt_tx) { pkt_tx_peak = k_mem_slab_max_used_get(pkt_tx); pkt_tx_total = pkt_tx->info.num_blocks; }
                    }
#endif

                    /* mbedTLS private heap — TLS handshake is the dominant
                     * consumer (peaks during initial CONNECT, shrinks back
                     * during steady-state). Both queries are O(1). */
                    size_t mtls_cur = 0, mtls_max = 0;
#if defined(CONFIG_MBEDTLS_MEMORY_BUFFER_ALLOC_C)
                    {
                        size_t blk_unused;
                        mbedtls_memory_buffer_alloc_cur_get(&mtls_cur, &blk_unused);
                        mbedtls_memory_buffer_alloc_max_get(&mtls_max, &blk_unused);
                    }
#endif

                    /* heap= now reports the unified pool: malloc/new (via
                     * __wrap_*) and k_malloc both land in _system_heap. */
#ifdef CONFIG_SYS_HEAP_RUNTIME_STATS
                    struct sys_memory_stats stats;
                    sys_heap_runtime_stats_get(&_system_heap.heap, &stats);
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "heap=%u/%u(peak=%u) mtls=%u(peak=%u/%u) "
                            "stack=%u/%u http_stack=%u/%u "
                            "nbuf=rx%u/%u,tx%u/%u pkt=rx%u/%u,tx%u/%u "
                            "vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)stats.allocated_bytes,
                            (unsigned)CONFIG_HEAP_MEM_POOL_SIZE,
                            (unsigned)stats.max_allocated_bytes,
                            (unsigned)mtls_cur, (unsigned)mtls_max,
                            (unsigned)CONFIG_MBEDTLS_HEAP_SIZE,
                            (unsigned)stack_used, (unsigned)stack_size,
                            (unsigned)http_stack_used, (unsigned)http_stack_size,
                            (unsigned)nb_rx_peak, (unsigned)nb_rx_total,
                            (unsigned)nb_tx_peak, (unsigned)nb_tx_total,
                            (unsigned)pkt_rx_peak, (unsigned)pkt_rx_total,
                            (unsigned)pkt_tx_peak, (unsigned)pkt_tx_total,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#else
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "mtls=%u(peak=%u/%u) "
                            "stack=%u/%u http_stack=%u/%u "
                            "nbuf=rx%u/%u,tx%u/%u pkt=rx%u/%u,tx%u/%u "
                            "vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)mtls_cur, (unsigned)mtls_max,
                            (unsigned)CONFIG_MBEDTLS_HEAP_SIZE,
                            (unsigned)stack_used, (unsigned)stack_size,
                            (unsigned)http_stack_used, (unsigned)http_stack_size,
                            (unsigned)nb_rx_peak, (unsigned)nb_rx_total,
                            (unsigned)nb_tx_peak, (unsigned)nb_tx_total,
                            (unsigned)pkt_rx_peak, (unsigned)pkt_rx_total,
                            (unsigned)pkt_tx_peak, (unsigned)pkt_tx_total,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#endif
                    last_status_log_ms = now_ms;
                }

                k_msleep(100);  /* 100ms loop — responsive to LoRa packets */
            }
            break;
        }

        case STATE_ERROR:
            neopixel_set(NEO_RED,  NEO_OFF); /* Red = error */
            breathing_led_stop();
            led_set(false);
            LOG_ERR("Error state. Retrying in 30s...");
            k_msleep(30000);
            app_state = thread_attached ? STATE_DNS_RESOLVE : STATE_WAIT_THREAD;
            retry_count = 0;
            break;
        }
    }

    return 0;
}
